huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/*
 * File:           E:\STM32F103VCT6_DSP\STM32F103VCT6_DSP_APP\SigmaStudio_Dsp - 副本\Dsp_IC_1_REG.h
 *
 * Created:        Wednesday, March 20, 2019 2:24:45 PM
 * Description:    Dsp:IC 1 control register definitions.
 *
 * This software is distributed in the hope that it will be useful,
 * but is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
 * CONDITIONS OF ANY KIND, without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * This software may only be used to program products purchased from
 * Analog Devices for incorporation by you into audio products that
 * are intended for resale to audio product end users. This software
 * may not be distributed whole or in any part to third parties.
 *
 * Copyright ©2019 Analog Devices, Inc. All rights reserved.
 */
#ifndef __DSP_IC_1_REG_H__
#define __DSP_IC_1_REG_H__


/* PLL_CTRL0  - Registers (IC 1) */
#define REG_PLL_CTRL0_IC_1_ADDR                   0xF000
#define REG_PLL_CTRL0_IC_1_BYTE                   2
#define REG_PLL_CTRL0_IC_1_VALUE                  0x60

/* PLL_CTRL1  - Registers (IC 1) */
#define REG_PLL_CTRL1_IC_1_ADDR                   0xF001
#define REG_PLL_CTRL1_IC_1_BYTE                   2
#define REG_PLL_CTRL1_IC_1_VALUE                  0x2

/* PLL_CLK_SRC  - Registers (IC 1) */
#define REG_PLL_CLK_SRC_IC_1_ADDR                 0xF002
#define REG_PLL_CLK_SRC_IC_1_BYTE                 2
#define REG_PLL_CLK_SRC_IC_1_VALUE                0x1

/* PLL_ENABLE  - Registers (IC 1) */
#define REG_PLL_ENABLE_IC_1_ADDR                  0xF003
#define REG_PLL_ENABLE_IC_1_BYTE                  2
#define REG_PLL_ENABLE_IC_1_VALUE                 0x1

/* PLL_LOCK  - Registers (IC 1) */
#define REG_PLL_LOCK_IC_1_ADDR                    0xF004
#define REG_PLL_LOCK_IC_1_BYTE                    0
#define REG_PLL_LOCK_IC_1_VALUE                   0x0

/* MCLK_OUT  - Registers (IC 1) */
#define REG_MCLK_OUT_IC_1_ADDR                    0xF005
#define REG_MCLK_OUT_IC_1_BYTE                    2
#define REG_MCLK_OUT_IC_1_VALUE                   0x5

/* PLL_WATCHDOG  - Registers (IC 1) */
#define REG_PLL_WATCHDOG_IC_1_ADDR                0xF006
#define REG_PLL_WATCHDOG_IC_1_BYTE                2
#define REG_PLL_WATCHDOG_IC_1_VALUE               0x1

/* CLK_GEN1_M  - Registers (IC 1) */
#define REG_CLK_GEN1_M_IC_1_ADDR                  0xF020
#define REG_CLK_GEN1_M_IC_1_BYTE                  2
#define REG_CLK_GEN1_M_IC_1_VALUE                 0x6

/* CLK_GEN1_N  - Registers (IC 1) */
#define REG_CLK_GEN1_N_IC_1_ADDR                  0xF021
#define REG_CLK_GEN1_N_IC_1_BYTE                  2
#define REG_CLK_GEN1_N_IC_1_VALUE                 0x1

/* CLK_GEN2_M  - Registers (IC 1) */
#define REG_CLK_GEN2_M_IC_1_ADDR                  0xF022
#define REG_CLK_GEN2_M_IC_1_BYTE                  2
#define REG_CLK_GEN2_M_IC_1_VALUE                 0x9

/* CLK_GEN2_N  - Registers (IC 1) */
#define REG_CLK_GEN2_N_IC_1_ADDR                  0xF023
#define REG_CLK_GEN2_N_IC_1_BYTE                  2
#define REG_CLK_GEN2_N_IC_1_VALUE                 0x1

/* CLK_GEN3_M  - Registers (IC 1) */
#define REG_CLK_GEN3_M_IC_1_ADDR                  0xF024
#define REG_CLK_GEN3_M_IC_1_BYTE                  2
#define REG_CLK_GEN3_M_IC_1_VALUE                 0x0

/* CLK_GEN3_N  - Registers (IC 1) */
#define REG_CLK_GEN3_N_IC_1_ADDR                  0xF025
#define REG_CLK_GEN3_N_IC_1_BYTE                  2
#define REG_CLK_GEN3_N_IC_1_VALUE                 0x0

/* CLK_GEN3_SRC  - Registers (IC 1) */
#define REG_CLK_GEN3_SRC_IC_1_ADDR                0xF026
#define REG_CLK_GEN3_SRC_IC_1_BYTE                2
#define REG_CLK_GEN3_SRC_IC_1_VALUE               0xE

/* CLK_GEN3_LOCK  - Registers (IC 1) */
#define REG_CLK_GEN3_LOCK_IC_1_ADDR               0xF027
#define REG_CLK_GEN3_LOCK_IC_1_BYTE               0
#define REG_CLK_GEN3_LOCK_IC_1_VALUE              0x0

/* POWER_ENABLE0  - Registers (IC 1) */
#define REG_POWER_ENABLE0_IC_1_ADDR               0xF050
#define REG_POWER_ENABLE0_IC_1_BYTE               2
#define REG_POWER_ENABLE0_IC_1_VALUE              0x1FFF

/* POWER_ENABLE1  - Registers (IC 1) */
#define REG_POWER_ENABLE1_IC_1_ADDR               0xF051
#define REG_POWER_ENABLE1_IC_1_BYTE               2
#define REG_POWER_ENABLE1_IC_1_VALUE              0x1F

/* ASRC_INPUT0  - Registers (IC 1) */
#define REG_ASRC_INPUT0_IC_1_ADDR                 0xF100
#define REG_ASRC_INPUT0_IC_1_BYTE                 2
#define REG_ASRC_INPUT0_IC_1_VALUE                0x3

/* ASRC_INPUT1  - Registers (IC 1) */
#define REG_ASRC_INPUT1_IC_1_ADDR                 0xF101
#define REG_ASRC_INPUT1_IC_1_BYTE                 2
#define REG_ASRC_INPUT1_IC_1_VALUE                0x0

/* ASRC_INPUT2  - Registers (IC 1) */
#define REG_ASRC_INPUT2_IC_1_ADDR                 0xF102
#define REG_ASRC_INPUT2_IC_1_BYTE                 2
#define REG_ASRC_INPUT2_IC_1_VALUE                0x0

/* ASRC_INPUT3  - Registers (IC 1) */
#define REG_ASRC_INPUT3_IC_1_ADDR                 0xF103
#define REG_ASRC_INPUT3_IC_1_BYTE                 2
#define REG_ASRC_INPUT3_IC_1_VALUE                0x0

/* ASRC_INPUT4  - Registers (IC 1) */
#define REG_ASRC_INPUT4_IC_1_ADDR                 0xF104
#define REG_ASRC_INPUT4_IC_1_BYTE                 2
#define REG_ASRC_INPUT4_IC_1_VALUE                0x0

/* ASRC_INPUT5  - Registers (IC 1) */
#define REG_ASRC_INPUT5_IC_1_ADDR                 0xF105
#define REG_ASRC_INPUT5_IC_1_BYTE                 2
#define REG_ASRC_INPUT5_IC_1_VALUE                0x0

/* ASRC_INPUT6  - Registers (IC 1) */
#define REG_ASRC_INPUT6_IC_1_ADDR                 0xF106
#define REG_ASRC_INPUT6_IC_1_BYTE                 2
#define REG_ASRC_INPUT6_IC_1_VALUE                0x0

/* ASRC_INPUT7  - Registers (IC 1) */
#define REG_ASRC_INPUT7_IC_1_ADDR                 0xF107
#define REG_ASRC_INPUT7_IC_1_BYTE                 2
#define REG_ASRC_INPUT7_IC_1_VALUE                0x0

/* ASRC_OUT_RATE0  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE0_IC_1_ADDR              0xF140
#define REG_ASRC_OUT_RATE0_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE0_IC_1_VALUE             0x5

/* ASRC_OUT_RATE1  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE1_IC_1_ADDR              0xF141
#define REG_ASRC_OUT_RATE1_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE1_IC_1_VALUE             0x0

/* ASRC_OUT_RATE2  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE2_IC_1_ADDR              0xF142
#define REG_ASRC_OUT_RATE2_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE2_IC_1_VALUE             0x0

/* ASRC_OUT_RATE3  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE3_IC_1_ADDR              0xF143
#define REG_ASRC_OUT_RATE3_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE3_IC_1_VALUE             0x0

/* ASRC_OUT_RATE4  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE4_IC_1_ADDR              0xF144
#define REG_ASRC_OUT_RATE4_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE4_IC_1_VALUE             0x0

/* ASRC_OUT_RATE5  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE5_IC_1_ADDR              0xF145
#define REG_ASRC_OUT_RATE5_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE5_IC_1_VALUE             0x0

/* ASRC_OUT_RATE6  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE6_IC_1_ADDR              0xF146
#define REG_ASRC_OUT_RATE6_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE6_IC_1_VALUE             0x0

/* ASRC_OUT_RATE7  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE7_IC_1_ADDR              0xF147
#define REG_ASRC_OUT_RATE7_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE7_IC_1_VALUE             0x0

/* SOUT_SOURCE0  - Registers (IC 1) */
#define REG_SOUT_SOURCE0_IC_1_ADDR                0xF180
#define REG_SOUT_SOURCE0_IC_1_BYTE                2
#define REG_SOUT_SOURCE0_IC_1_VALUE               0x2

/* SOUT_SOURCE1  - Registers (IC 1) */
#define REG_SOUT_SOURCE1_IC_1_ADDR                0xF181
#define REG_SOUT_SOURCE1_IC_1_BYTE                2
#define REG_SOUT_SOURCE1_IC_1_VALUE               0x2

/* SOUT_SOURCE2  - Registers (IC 1) */
#define REG_SOUT_SOURCE2_IC_1_ADDR                0xF182
#define REG_SOUT_SOURCE2_IC_1_BYTE                2
#define REG_SOUT_SOURCE2_IC_1_VALUE               0x2

/* SOUT_SOURCE3  - Registers (IC 1) */
#define REG_SOUT_SOURCE3_IC_1_ADDR                0xF183
#define REG_SOUT_SOURCE3_IC_1_BYTE                2
#define REG_SOUT_SOURCE3_IC_1_VALUE               0x2

/* SOUT_SOURCE4  - Registers (IC 1) */
#define REG_SOUT_SOURCE4_IC_1_ADDR                0xF184
#define REG_SOUT_SOURCE4_IC_1_BYTE                2
#define REG_SOUT_SOURCE4_IC_1_VALUE               0x2

/* SOUT_SOURCE5  - Registers (IC 1) */
#define REG_SOUT_SOURCE5_IC_1_ADDR                0xF185
#define REG_SOUT_SOURCE5_IC_1_BYTE                2
#define REG_SOUT_SOURCE5_IC_1_VALUE               0x2

/* SOUT_SOURCE6  - Registers (IC 1) */
#define REG_SOUT_SOURCE6_IC_1_ADDR                0xF186
#define REG_SOUT_SOURCE6_IC_1_BYTE                2
#define REG_SOUT_SOURCE6_IC_1_VALUE               0x2

/* SOUT_SOURCE7  - Registers (IC 1) */
#define REG_SOUT_SOURCE7_IC_1_ADDR                0xF187
#define REG_SOUT_SOURCE7_IC_1_BYTE                2
#define REG_SOUT_SOURCE7_IC_1_VALUE               0x2

/* SOUT_SOURCE8  - Registers (IC 1) */
#define REG_SOUT_SOURCE8_IC_1_ADDR                0xF188
#define REG_SOUT_SOURCE8_IC_1_BYTE                2
#define REG_SOUT_SOURCE8_IC_1_VALUE               0x2

