huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* PANIC_CLEAR  - Registers (IC 1) */
#define REG_PANIC_CLEAR_IC_1_ADDR                 0xF421
#define REG_PANIC_CLEAR_IC_1_BYTE                 2
#define REG_PANIC_CLEAR_IC_1_VALUE                0x0

/* PANIC_PARITY_MASK  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK_IC_1_ADDR           0xF422
#define REG_PANIC_PARITY_MASK_IC_1_BYTE           2
#define REG_PANIC_PARITY_MASK_IC_1_VALUE          0xFFF

/* PANIC_SOFTWARE_MASK  - Registers (IC 1) */
#define REG_PANIC_SOFTWARE_MASK_IC_1_ADDR         0xF423
#define REG_PANIC_SOFTWARE_MASK_IC_1_BYTE         2
#define REG_PANIC_SOFTWARE_MASK_IC_1_VALUE        0x0

/* PANIC_WD_MASK  - Registers (IC 1) */
#define REG_PANIC_WD_MASK_IC_1_ADDR               0xF424
#define REG_PANIC_WD_MASK_IC_1_BYTE               2
#define REG_PANIC_WD_MASK_IC_1_VALUE              0x0

/* PANIC_STACK_MASK  - Registers (IC 1) */
#define REG_PANIC_STACK_MASK_IC_1_ADDR            0xF425
#define REG_PANIC_STACK_MASK_IC_1_BYTE            2
#define REG_PANIC_STACK_MASK_IC_1_VALUE           0x0

/* PANIC_LOOP_MASK  - Registers (IC 1) */
#define REG_PANIC_LOOP_MASK_IC_1_ADDR             0xF426
#define REG_PANIC_LOOP_MASK_IC_1_BYTE             2
#define REG_PANIC_LOOP_MASK_IC_1_VALUE            0x0

/* PANIC_FLAG  - Registers (IC 1) */
#define REG_PANIC_FLAG_IC_1_ADDR                  0xF427
#define REG_PANIC_FLAG_IC_1_BYTE                  0
#define REG_PANIC_FLAG_IC_1_VALUE                 0x0

/* PANIC_CODE  - Registers (IC 1) */
#define REG_PANIC_CODE_IC_1_ADDR                  0xF428
#define REG_PANIC_CODE_IC_1_BYTE                  0
#define REG_PANIC_CODE_IC_1_VALUE                 0x0

/* DECODE_OP0  - Registers (IC 1) */
#define REG_DECODE_OP0_IC_1_ADDR                  0xF429
#define REG_DECODE_OP0_IC_1_BYTE                  0
#define REG_DECODE_OP0_IC_1_VALUE                 0x0

/* DECODE_OP1  - Registers (IC 1) */
#define REG_DECODE_OP1_IC_1_ADDR                  0xF42A
#define REG_DECODE_OP1_IC_1_BYTE                  0
#define REG_DECODE_OP1_IC_1_VALUE                 0x0

/* DECODE_OP2  - Registers (IC 1) */
#define REG_DECODE_OP2_IC_1_ADDR                  0xF42B
#define REG_DECODE_OP2_IC_1_BYTE                  0
#define REG_DECODE_OP2_IC_1_VALUE                 0x0

/* DECODE_OP3  - Registers (IC 1) */
#define REG_DECODE_OP3_IC_1_ADDR                  0xF42C
#define REG_DECODE_OP3_IC_1_BYTE                  0
#define REG_DECODE_OP3_IC_1_VALUE                 0x0

/* EXECUTE_OP0  - Registers (IC 1) */
#define REG_EXECUTE_OP0_IC_1_ADDR                 0xF42D
#define REG_EXECUTE_OP0_IC_1_BYTE                 0
#define REG_EXECUTE_OP0_IC_1_VALUE                0x0

/* EXECUTE_OP1  - Registers (IC 1) */
#define REG_EXECUTE_OP1_IC_1_ADDR                 0xF42E
#define REG_EXECUTE_OP1_IC_1_BYTE                 0
#define REG_EXECUTE_OP1_IC_1_VALUE                0x0

/* EXECUTE_OP2  - Registers (IC 1) */
#define REG_EXECUTE_OP2_IC_1_ADDR                 0xF42F
#define REG_EXECUTE_OP2_IC_1_BYTE                 0
#define REG_EXECUTE_OP2_IC_1_VALUE                0x0

/* EXECUTE_OP3  - Registers (IC 1) */
#define REG_EXECUTE_OP3_IC_1_ADDR                 0xF430
#define REG_EXECUTE_OP3_IC_1_BYTE                 0
#define REG_EXECUTE_OP3_IC_1_VALUE                0x0

/* DECODE_COUNT  - Registers (IC 1) */
#define REG_DECODE_COUNT_IC_1_ADDR                0xF431
#define REG_DECODE_COUNT_IC_1_BYTE                0
#define REG_DECODE_COUNT_IC_1_VALUE               0x0

/* EXECUTE_COUNT  - Registers (IC 1) */
#define REG_EXECUTE_COUNT_IC_1_ADDR               0xF432
#define REG_EXECUTE_COUNT_IC_1_BYTE               0
#define REG_EXECUTE_COUNT_IC_1_VALUE              0x0

/* SOFTWARE_VALUE_0  - Registers (IC 1) */
#define REG_SOFTWARE_VALUE_0_IC_1_ADDR            0xF433
#define REG_SOFTWARE_VALUE_0_IC_1_BYTE            0
#define REG_SOFTWARE_VALUE_0_IC_1_VALUE           0x0

/* SOFTWARE_VALUE_1  - Registers (IC 1) */
#define REG_SOFTWARE_VALUE_1_IC_1_ADDR            0xF434
#define REG_SOFTWARE_VALUE_1_IC_1_BYTE            0
#define REG_SOFTWARE_VALUE_1_IC_1_VALUE           0x0

/* WATCHDOG_MAXCOUNT  - Registers (IC 1) */
#define REG_WATCHDOG_MAXCOUNT_IC_1_ADDR           0xF443
#define REG_WATCHDOG_MAXCOUNT_IC_1_BYTE           2
#define REG_WATCHDOG_MAXCOUNT_IC_1_VALUE          0x0

/* WATCHDOG_PRESCALE  - Registers (IC 1) */
#define REG_WATCHDOG_PRESCALE_IC_1_ADDR           0xF444
#define REG_WATCHDOG_PRESCALE_IC_1_BYTE           2
#define REG_WATCHDOG_PRESCALE_IC_1_VALUE          0x0

/* BLOCKINT_EN  - Registers (IC 1) */
#define REG_BLOCKINT_EN_IC_1_ADDR                 0xF450
#define REG_BLOCKINT_EN_IC_1_BYTE                 2
#define REG_BLOCKINT_EN_IC_1_VALUE                0x0

/* BLOCKINT_VALUE  - Registers (IC 1) */
#define REG_BLOCKINT_VALUE_IC_1_ADDR              0xF451
#define REG_BLOCKINT_VALUE_IC_1_BYTE              2
#define REG_BLOCKINT_VALUE_IC_1_VALUE             0x0

/* PROG_CNTR0  - Registers (IC 1) */
#define REG_PROG_CNTR0_IC_1_ADDR                  0xF460
#define REG_PROG_CNTR0_IC_1_BYTE                  0
#define REG_PROG_CNTR0_IC_1_VALUE                 0x0

/* PROG_CNTR1  - Registers (IC 1) */
#define REG_PROG_CNTR1_IC_1_ADDR                  0xF461
#define REG_PROG_CNTR1_IC_1_BYTE                  0
#define REG_PROG_CNTR1_IC_1_VALUE                 0x0

/* PROG_CNTR_CLEAR  - Registers (IC 1) */
#define REG_PROG_CNTR_CLEAR_IC_1_ADDR             0xF462
#define REG_PROG_CNTR_CLEAR_IC_1_BYTE             2
#define REG_PROG_CNTR_CLEAR_IC_1_VALUE            0x0

/* PROG_CNTR_LENGTH0  - Registers (IC 1) */
#define REG_PROG_CNTR_LENGTH0_IC_1_ADDR           0xF463
#define REG_PROG_CNTR_LENGTH0_IC_1_BYTE           0
#define REG_PROG_CNTR_LENGTH0_IC_1_VALUE          0x0

/* PROG_CNTR_LENGTH1  - Registers (IC 1) */
#define REG_PROG_CNTR_LENGTH1_IC_1_ADDR           0xF464
#define REG_PROG_CNTR_LENGTH1_IC_1_BYTE           0
#define REG_PROG_CNTR_LENGTH1_IC_1_VALUE          0x0

/* PROG_CNTR_MAXLENGTH0  - Registers (IC 1) */
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_ADDR        0xF465
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_BYTE        0
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_VALUE       0x0

/* PROG_CNTR_MAXLENGTH1  - Registers (IC 1) */
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_ADDR        0xF466
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_BYTE        0
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_VALUE       0x0

/* MP0_MODE  - Registers (IC 1) */
#define REG_MP0_MODE_IC_1_ADDR                    0xF510
#define REG_MP0_MODE_IC_1_BYTE                    2
#define REG_MP0_MODE_IC_1_VALUE                   0x0

/* MP1_MODE  - Registers (IC 1) */
#define REG_MP1_MODE_IC_1_ADDR                    0xF511
#define REG_MP1_MODE_IC_1_BYTE                    2
#define REG_MP1_MODE_IC_1_VALUE                   0x0

/* MP2_MODE  - Registers (IC 1) */
#define REG_MP2_MODE_IC_1_ADDR                    0xF512
#define REG_MP2_MODE_IC_1_BYTE                    2
#define REG_MP2_MODE_IC_1_VALUE                   0x0

/* MP3_MODE  - Registers (IC 1) */
#define REG_MP3_MODE_IC_1_ADDR                    0xF513
#define REG_MP3_MODE_IC_1_BYTE                    2
#define REG_MP3_MODE_IC_1_VALUE                   0x0

/* MP4_MODE  - Registers (IC 1) */
#define REG_MP4_MODE_IC_1_ADDR                    0xF514
#define REG_MP4_MODE_IC_1_BYTE                    2
#define REG_MP4_MODE_IC_1_VALUE                   0x0

/* MP5_MODE  - Registers (IC 1) */
#define REG_MP5_MODE_IC_1_ADDR                    0xF515
#define REG_MP5_MODE_IC_1_BYTE                    2
#define REG_MP5_MODE_IC_1_VALUE                   0x0

/* MP6_MODE  - Registers (IC 1) */
#define REG_MP6_MODE_IC_1_ADDR                    0xF516
#define REG_MP6_MODE_IC_1_BYTE                    2
#define REG_MP6_MODE_IC_1_VALUE                   0x0

/* MP7_MODE  - Registers (IC 1) */
#define REG_MP7_MODE_IC_1_ADDR                    0xF517
#define REG_MP7_MODE_IC_1_BYTE                    2
#define REG_MP7_MODE_IC_1_VALUE                   0x0

/* MP8_MODE  - Registers (IC 1) */
#define REG_MP8_MODE_IC_1_ADDR                    0xF518
#define REG_MP8_MODE_IC_1_BYTE                    2
#define REG_MP8_MODE_IC_1_VALUE                   0x0

/* MP9_MODE  - Registers (IC 1) */
#define REG_MP9_MODE_IC_1_ADDR                    0xF519
#define REG_MP9_MODE_IC_1_BYTE                    2
#define REG_MP9_MODE_IC_1_VALUE                   0x0

/* MP10_MODE  - Registers (IC 1) */
#define REG_MP10_MODE_IC_1_ADDR                   0xF51A
#define REG_MP10_MODE_IC_1_BYTE                   2
#define REG_MP10_MODE_IC_1_VALUE                  0x0

/* MP11_MODE  - Registers (IC 1) */
#define REG_MP11_MODE_IC_1_ADDR                   0xF51B
#define REG_MP11_MODE_IC_1_BYTE                   2
#define REG_MP11_MODE_IC_1_VALUE                  0x0

/* MP12_MODE  - Registers (IC 1) */
#define REG_MP12_MODE_IC_1_ADDR                   0xF51C
#define REG_MP12_MODE_IC_1_BYTE                   2
#define REG_MP12_MODE_IC_1_VALUE                  0x0

/* MP13_MODE  - Registers (IC 1) */
#define REG_MP13_MODE_IC_1_ADDR                   0xF51D
#define REG_MP13_MODE_IC_1_BYTE                   2
#define REG_MP13_MODE_IC_1_VALUE                  0x0

