huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* ADC_READ1  - Registers (IC 1) */
#define REG_ADC_READ1_IC_1_ADDR                   0xF5A1
#define REG_ADC_READ1_IC_1_BYTE                   0
#define REG_ADC_READ1_IC_1_VALUE                  0x0

/* ADC_READ2  - Registers (IC 1) */
#define REG_ADC_READ2_IC_1_ADDR                   0xF5A2
#define REG_ADC_READ2_IC_1_BYTE                   0
#define REG_ADC_READ2_IC_1_VALUE                  0x0

/* ADC_READ3  - Registers (IC 1) */
#define REG_ADC_READ3_IC_1_ADDR                   0xF5A3
#define REG_ADC_READ3_IC_1_BYTE                   0
#define REG_ADC_READ3_IC_1_VALUE                  0x0

/* ADC_READ4  - Registers (IC 1) */
#define REG_ADC_READ4_IC_1_ADDR                   0xF5A4
#define REG_ADC_READ4_IC_1_BYTE                   0
#define REG_ADC_READ4_IC_1_VALUE                  0x0

/* ADC_READ5  - Registers (IC 1) */
#define REG_ADC_READ5_IC_1_ADDR                   0xF5A5
#define REG_ADC_READ5_IC_1_BYTE                   0
#define REG_ADC_READ5_IC_1_VALUE                  0x0

/* SPDIF_LOCK_DET  - Registers (IC 1) */
#define REG_SPDIF_LOCK_DET_IC_1_ADDR              0xF600
#define REG_SPDIF_LOCK_DET_IC_1_BYTE              0
#define REG_SPDIF_LOCK_DET_IC_1_VALUE             0x0

/* SPDIF_RX_CTRL  - Registers (IC 1) */
#define REG_SPDIF_RX_CTRL_IC_1_ADDR               0xF601
#define REG_SPDIF_RX_CTRL_IC_1_BYTE               2
#define REG_SPDIF_RX_CTRL_IC_1_VALUE              0x0

/* SPDIF_RX_DECODE  - Registers (IC 1) */
#define REG_SPDIF_RX_DECODE_IC_1_ADDR             0xF602
#define REG_SPDIF_RX_DECODE_IC_1_BYTE             0
#define REG_SPDIF_RX_DECODE_IC_1_VALUE            0x88

/* SPDIF_RX_COMPRMODE  - Registers (IC 1) */
#define REG_SPDIF_RX_COMPRMODE_IC_1_ADDR          0xF603
#define REG_SPDIF_RX_COMPRMODE_IC_1_BYTE          0
#define REG_SPDIF_RX_COMPRMODE_IC_1_VALUE         0x0

/* SPDIF_RESTART  - Registers (IC 1) */
#define REG_SPDIF_RESTART_IC_1_ADDR               0xF604
#define REG_SPDIF_RESTART_IC_1_BYTE               2
#define REG_SPDIF_RESTART_IC_1_VALUE              0x1

/* SPDIF_LOSS_OF_LOCK  - Registers (IC 1) */
#define REG_SPDIF_LOSS_OF_LOCK_IC_1_ADDR          0xF605
#define REG_SPDIF_LOSS_OF_LOCK_IC_1_BYTE          0
#define REG_SPDIF_LOSS_OF_LOCK_IC_1_VALUE         0x0

/* SPDIF_AUX_EN  - Registers (IC 1) */
#define REG_SPDIF_AUX_EN_IC_1_ADDR                0xF608
#define REG_SPDIF_AUX_EN_IC_1_BYTE                2
#define REG_SPDIF_AUX_EN_IC_1_VALUE               0x0

/* SPDIF_RX_AUXBIT_READY  - Registers (IC 1) */
#define REG_SPDIF_RX_AUXBIT_READY_IC_1_ADDR       0xF60F
#define REG_SPDIF_RX_AUXBIT_READY_IC_1_BYTE       0
#define REG_SPDIF_RX_AUXBIT_READY_IC_1_VALUE      0x0

/* SPDIF_RX_CS_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_0_IC_1_ADDR          0xF610
#define REG_SPDIF_RX_CS_LEFT_0_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_1_IC_1_ADDR          0xF611
#define REG_SPDIF_RX_CS_LEFT_1_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_2_IC_1_ADDR          0xF612
#define REG_SPDIF_RX_CS_LEFT_2_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_3_IC_1_ADDR          0xF613
#define REG_SPDIF_RX_CS_LEFT_3_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_4_IC_1_ADDR          0xF614
#define REG_SPDIF_RX_CS_LEFT_4_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_5_IC_1_ADDR          0xF615
#define REG_SPDIF_RX_CS_LEFT_5_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_6_IC_1_ADDR          0xF616
#define REG_SPDIF_RX_CS_LEFT_6_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_7_IC_1_ADDR          0xF617
#define REG_SPDIF_RX_CS_LEFT_7_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_8_IC_1_ADDR          0xF618
#define REG_SPDIF_RX_CS_LEFT_8_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_9_IC_1_ADDR          0xF619
#define REG_SPDIF_RX_CS_LEFT_9_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_10_IC_1_ADDR         0xF61A
#define REG_SPDIF_RX_CS_LEFT_10_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_RX_CS_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_11_IC_1_ADDR         0xF61B
#define REG_SPDIF_RX_CS_LEFT_11_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_0_IC_1_ADDR         0xF620
#define REG_SPDIF_RX_CS_RIGHT_0_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_1_IC_1_ADDR         0xF621
#define REG_SPDIF_RX_CS_RIGHT_1_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_2_IC_1_ADDR         0xF622
#define REG_SPDIF_RX_CS_RIGHT_2_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_3_IC_1_ADDR         0xF623
#define REG_SPDIF_RX_CS_RIGHT_3_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_3_IC_1_VALUE        0x0

