huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* SPDIF_RX_UD_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_RIGHT_10_IC_1_ADDR        0xF64A
#define REG_SPDIF_RX_UD_RIGHT_10_IC_1_BYTE        0
#define REG_SPDIF_RX_UD_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_RX_UD_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_RIGHT_11_IC_1_ADDR        0xF64B
#define REG_SPDIF_RX_UD_RIGHT_11_IC_1_BYTE        0
#define REG_SPDIF_RX_UD_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_RX_VB_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_0_IC_1_ADDR          0xF650
#define REG_SPDIF_RX_VB_LEFT_0_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_1_IC_1_ADDR          0xF651
#define REG_SPDIF_RX_VB_LEFT_1_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_2_IC_1_ADDR          0xF652
#define REG_SPDIF_RX_VB_LEFT_2_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_3_IC_1_ADDR          0xF653
#define REG_SPDIF_RX_VB_LEFT_3_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_4_IC_1_ADDR          0xF654
#define REG_SPDIF_RX_VB_LEFT_4_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_5_IC_1_ADDR          0xF655
#define REG_SPDIF_RX_VB_LEFT_5_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_6_IC_1_ADDR          0xF656
#define REG_SPDIF_RX_VB_LEFT_6_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_7_IC_1_ADDR          0xF657
#define REG_SPDIF_RX_VB_LEFT_7_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_8_IC_1_ADDR          0xF658
#define REG_SPDIF_RX_VB_LEFT_8_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_9_IC_1_ADDR          0xF659
#define REG_SPDIF_RX_VB_LEFT_9_IC_1_BYTE          0
#define REG_SPDIF_RX_VB_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_RX_VB_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_10_IC_1_ADDR         0xF65A
#define REG_SPDIF_RX_VB_LEFT_10_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_RX_VB_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_LEFT_11_IC_1_ADDR         0xF65B
#define REG_SPDIF_RX_VB_LEFT_11_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_0_IC_1_ADDR         0xF660
#define REG_SPDIF_RX_VB_RIGHT_0_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_1_IC_1_ADDR         0xF661
#define REG_SPDIF_RX_VB_RIGHT_1_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_2_IC_1_ADDR         0xF662
#define REG_SPDIF_RX_VB_RIGHT_2_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_3_IC_1_ADDR         0xF663
#define REG_SPDIF_RX_VB_RIGHT_3_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_3_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_4_IC_1_ADDR         0xF664
#define REG_SPDIF_RX_VB_RIGHT_4_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_4_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_5_IC_1_ADDR         0xF665
#define REG_SPDIF_RX_VB_RIGHT_5_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_5_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_6_IC_1_ADDR         0xF666
#define REG_SPDIF_RX_VB_RIGHT_6_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_6_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_7_IC_1_ADDR         0xF667
#define REG_SPDIF_RX_VB_RIGHT_7_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_7_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_8_IC_1_ADDR         0xF668
#define REG_SPDIF_RX_VB_RIGHT_8_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_8_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_9_IC_1_ADDR         0xF669
#define REG_SPDIF_RX_VB_RIGHT_9_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_10_IC_1_ADDR        0xF66A
#define REG_SPDIF_RX_VB_RIGHT_10_IC_1_BYTE        0
#define REG_SPDIF_RX_VB_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_RX_VB_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_11_IC_1_ADDR        0xF66B
#define REG_SPDIF_RX_VB_RIGHT_11_IC_1_BYTE        0
#define REG_SPDIF_RX_VB_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_RX_PB_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_0_IC_1_ADDR          0xF670
#define REG_SPDIF_RX_PB_LEFT_0_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_1_IC_1_ADDR          0xF671
#define REG_SPDIF_RX_PB_LEFT_1_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_2_IC_1_ADDR          0xF672
#define REG_SPDIF_RX_PB_LEFT_2_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_3_IC_1_ADDR          0xF673
#define REG_SPDIF_RX_PB_LEFT_3_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_4_IC_1_ADDR          0xF674
#define REG_SPDIF_RX_PB_LEFT_4_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_5_IC_1_ADDR          0xF675
#define REG_SPDIF_RX_PB_LEFT_5_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_6_IC_1_ADDR          0xF676
#define REG_SPDIF_RX_PB_LEFT_6_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_7_IC_1_ADDR          0xF677
#define REG_SPDIF_RX_PB_LEFT_7_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_7_IC_1_VALUE         0x0

