huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* SPDIF_TX_VB_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_9_IC_1_ADDR         0xF6F9
#define REG_SPDIF_TX_VB_RIGHT_9_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_10_IC_1_ADDR        0xF6FA
#define REG_SPDIF_TX_VB_RIGHT_10_IC_1_BYTE        2
#define REG_SPDIF_TX_VB_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_TX_VB_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_11_IC_1_ADDR        0xF6FB
#define REG_SPDIF_TX_VB_RIGHT_11_IC_1_BYTE        2
#define REG_SPDIF_TX_VB_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_TX_PB_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_0_IC_1_ADDR          0xF700
#define REG_SPDIF_TX_PB_LEFT_0_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_1_IC_1_ADDR          0xF701
#define REG_SPDIF_TX_PB_LEFT_1_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_2_IC_1_ADDR          0xF702
#define REG_SPDIF_TX_PB_LEFT_2_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_3_IC_1_ADDR          0xF703
#define REG_SPDIF_TX_PB_LEFT_3_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_4_IC_1_ADDR          0xF704
#define REG_SPDIF_TX_PB_LEFT_4_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_5_IC_1_ADDR          0xF705
#define REG_SPDIF_TX_PB_LEFT_5_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_6_IC_1_ADDR          0xF706
#define REG_SPDIF_TX_PB_LEFT_6_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_7_IC_1_ADDR          0xF707
#define REG_SPDIF_TX_PB_LEFT_7_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_8_IC_1_ADDR          0xF708
#define REG_SPDIF_TX_PB_LEFT_8_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_9_IC_1_ADDR          0xF709
#define REG_SPDIF_TX_PB_LEFT_9_IC_1_BYTE          2
#define REG_SPDIF_TX_PB_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_TX_PB_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_10_IC_1_ADDR         0xF70A
#define REG_SPDIF_TX_PB_LEFT_10_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_TX_PB_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_LEFT_11_IC_1_ADDR         0xF70B
#define REG_SPDIF_TX_PB_LEFT_11_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_0_IC_1_ADDR         0xF710
#define REG_SPDIF_TX_PB_RIGHT_0_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_1_IC_1_ADDR         0xF711
#define REG_SPDIF_TX_PB_RIGHT_1_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_2_IC_1_ADDR         0xF712
#define REG_SPDIF_TX_PB_RIGHT_2_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_3_IC_1_ADDR         0xF713
#define REG_SPDIF_TX_PB_RIGHT_3_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_3_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_4_IC_1_ADDR         0xF714
#define REG_SPDIF_TX_PB_RIGHT_4_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_4_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_5_IC_1_ADDR         0xF715
#define REG_SPDIF_TX_PB_RIGHT_5_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_5_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_6_IC_1_ADDR         0xF716
#define REG_SPDIF_TX_PB_RIGHT_6_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_6_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_7_IC_1_ADDR         0xF717
#define REG_SPDIF_TX_PB_RIGHT_7_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_7_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_8_IC_1_ADDR         0xF718
#define REG_SPDIF_TX_PB_RIGHT_8_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_8_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_9_IC_1_ADDR         0xF719
#define REG_SPDIF_TX_PB_RIGHT_9_IC_1_BYTE         2
#define REG_SPDIF_TX_PB_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_TX_PB_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_10_IC_1_ADDR        0xF71A
#define REG_SPDIF_TX_PB_RIGHT_10_IC_1_BYTE        2
#define REG_SPDIF_TX_PB_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_TX_PB_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_PB_RIGHT_11_IC_1_ADDR        0xF71B
#define REG_SPDIF_TX_PB_RIGHT_11_IC_1_BYTE        2
#define REG_SPDIF_TX_PB_RIGHT_11_IC_1_VALUE       0x0

/* BCLK_IN0_PIN  - Registers (IC 1) */
#define REG_BCLK_IN0_PIN_IC_1_ADDR                0xF780
#define REG_BCLK_IN0_PIN_IC_1_BYTE                2
#define REG_BCLK_IN0_PIN_IC_1_VALUE               0x18

/* BCLK_IN1_PIN  - Registers (IC 1) */
#define REG_BCLK_IN1_PIN_IC_1_ADDR                0xF781
#define REG_BCLK_IN1_PIN_IC_1_BYTE                2
#define REG_BCLK_IN1_PIN_IC_1_VALUE               0x18

/* BCLK_IN2_PIN  - Registers (IC 1) */
#define REG_BCLK_IN2_PIN_IC_1_ADDR                0xF782
#define REG_BCLK_IN2_PIN_IC_1_BYTE                2
#define REG_BCLK_IN2_PIN_IC_1_VALUE               0x18

