huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* CLKOUT_PIN  - Registers (IC 1) */
#define REG_CLKOUT_PIN_IC_1_ADDR                  0xF7A3
#define REG_CLKOUT_PIN_IC_1_BYTE                  2
#define REG_CLKOUT_PIN_IC_1_VALUE                 0x8

/* SOFT_RESET  - Registers (IC 1) */
#define REG_SOFT_RESET_IC_1_ADDR                  0xF890
#define REG_SOFT_RESET_IC_1_BYTE                  2
#define REG_SOFT_RESET_IC_1_VALUE                 0x1


/*
 *
 * Control register's field descriptions
 *
 */

/* PLL_CTRL0 (IC 1) */
#define R0_PLL_CTRL0_PLL_FBDIVIDER_IC_1           0x60   /* 1100000b	[6:0] */
#define R0_PLL_CTRL0_PLL_FBDIVIDER_IC_1_MASK      0x7F
#define R0_PLL_CTRL0_PLL_FBDIVIDER_IC_1_SHIFT     0

/* PLL_CTRL1 (IC 1) */
#define R1_PLL_CTRL1_PLL_DIV_IC_1                 0x2    /* 10b	[1:0] */
#define R1_PLL_CTRL1_PLL_DIV_IC_1_MASK            0x3
#define R1_PLL_CTRL1_PLL_DIV_IC_1_SHIFT           0

/* PLL_CLK_SRC (IC 1) */
#define R2_PLL_CLK_SRC_CLKSRC_IC_1                0x1    /* 1b	[0] */
#define R2_PLL_CLK_SRC_CLKSRC_IC_1_MASK           0x1
#define R2_PLL_CLK_SRC_CLKSRC_IC_1_SHIFT          0

/* PLL_ENABLE (IC 1) */
#define R3_PLL_ENABLE_PLL_ENABLE_IC_1             0x1    /* 1b	[0] */
#define R3_PLL_ENABLE_PLL_ENABLE_IC_1_MASK        0x1
#define R3_PLL_ENABLE_PLL_ENABLE_IC_1_SHIFT       0

/* PLL_LOCK (IC 1) */
#define R4_PLL_LOCK_PLL_LOCK_IC_1                 0x0    /* 0b	[0] */
#define R4_PLL_LOCK_PLL_LOCK_IC_1_MASK            0x1
#define R4_PLL_LOCK_PLL_LOCK_IC_1_SHIFT           0

/* MCLK_OUT (IC 1) */
#define R5_MCLK_OUT_CLKOUT_ENABLE_IC_1            0x1    /* 1b	[0] */
#define R5_MCLK_OUT_CLKOUT_RATE_IC_1              0x2    /* 10b	[2:1] */
#define R5_MCLK_OUT_CLKOUT_ENABLE_IC_1_MASK       0x1
#define R5_MCLK_OUT_CLKOUT_ENABLE_IC_1_SHIFT      0
#define R5_MCLK_OUT_CLKOUT_RATE_IC_1_MASK         0x6
#define R5_MCLK_OUT_CLKOUT_RATE_IC_1_SHIFT        1

/* PLL_WATCHDOG (IC 1) */
#define R6_PLL_WATCHDOG_PLL_WATCHDOG_IC_1         0x1    /* 1b	[0] */
#define R6_PLL_WATCHDOG_PLL_WATCHDOG_IC_1_MASK    0x1
#define R6_PLL_WATCHDOG_PLL_WATCHDOG_IC_1_SHIFT   0

/* CLK_GEN1_M (IC 1) */
#define R7_CLK_GEN1_M_CLOCKGEN1_M_IC_1            0x06   /* 000000110b	[8:0] */
#define R7_CLK_GEN1_M_CLOCKGEN1_M_IC_1_MASK       0x1FF
#define R7_CLK_GEN1_M_CLOCKGEN1_M_IC_1_SHIFT      0

/* CLK_GEN1_N (IC 1) */
#define R8_CLK_GEN1_N_CLOCKGEN1_N_IC_1            0x01   /* 000000001b	[8:0] */
#define R8_CLK_GEN1_N_CLOCKGEN1_N_IC_1_MASK       0x1FF
#define R8_CLK_GEN1_N_CLOCKGEN1_N_IC_1_SHIFT      0

/* CLK_GEN2_M (IC 1) */
#define R9_CLK_GEN2_M_CLOCKGEN2_M_IC_1            0x09   /* 000001001b	[8:0] */
#define R9_CLK_GEN2_M_CLOCKGEN2_M_IC_1_MASK       0x1FF
#define R9_CLK_GEN2_M_CLOCKGEN2_M_IC_1_SHIFT      0

/* CLK_GEN2_N (IC 1) */
#define R10_CLK_GEN2_N_CLOCKGEN2_N_IC_1           0x01   /* 000000001b	[8:0] */
#define R10_CLK_GEN2_N_CLOCKGEN2_N_IC_1_MASK      0x1FF
#define R10_CLK_GEN2_N_CLOCKGEN2_N_IC_1_SHIFT     0

/* CLK_GEN3_M (IC 1) */
#define R11_CLK_GEN3_M_CLOCKGEN3_M_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R11_CLK_GEN3_M_CLOCKGEN3_M_IC_1_MASK      0xFFFF
#define R11_CLK_GEN3_M_CLOCKGEN3_M_IC_1_SHIFT     0

/* CLK_GEN3_N (IC 1) */
#define R12_CLK_GEN3_N_CLOCKGEN3_N_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R12_CLK_GEN3_N_CLOCKGEN3_N_IC_1_MASK      0xFFFF
#define R12_CLK_GEN3_N_CLOCKGEN3_N_IC_1_SHIFT     0

/* CLK_GEN3_SRC (IC 1) */
#define R13_CLK_GEN3_SRC_FREF_PIN_IC_1            0xE    /* 1110b	[3:0] */
#define R13_CLK_GEN3_SRC_CLK_GEN3_SRC_IC_1        0x0    /* 0b	[4] */
#define R13_CLK_GEN3_SRC_FREF_PIN_IC_1_MASK       0xF
#define R13_CLK_GEN3_SRC_FREF_PIN_IC_1_SHIFT      0
#define R13_CLK_GEN3_SRC_CLK_GEN3_SRC_IC_1_MASK   0x10
#define R13_CLK_GEN3_SRC_CLK_GEN3_SRC_IC_1_SHIFT  4

/* CLK_GEN3_LOCK (IC 1) */
#define R14_CLK_GEN3_LOCK_GEN3_LOCK_IC_1          0x0    /* 0b	[0] */
#define R14_CLK_GEN3_LOCK_GEN3_LOCK_IC_1_MASK     0x1
#define R14_CLK_GEN3_LOCK_GEN3_LOCK_IC_1_SHIFT    0

/* POWER_ENABLE0 (IC 1) */
#define R15_POWER_ENABLE0_SIN0_PWR_IC_1           0x1    /* 1b	[0] */
#define R15_POWER_ENABLE0_SIN1_PWR_IC_1           0x1    /* 1b	[1] */
#define R15_POWER_ENABLE0_SIN2_PWR_IC_1           0x1    /* 1b	[2] */
#define R15_POWER_ENABLE0_SIN3_PWR_IC_1           0x1    /* 1b	[3] */
#define R15_POWER_ENABLE0_SOUT0_PWR_IC_1          0x1    /* 1b	[4] */
#define R15_POWER_ENABLE0_SOUT1_PWR_IC_1          0x1    /* 1b	[5] */
#define R15_POWER_ENABLE0_SOUT2_PWR_IC_1          0x1    /* 1b	[6] */
#define R15_POWER_ENABLE0_SOUT3_PWR_IC_1          0x1    /* 1b	[7] */
#define R15_POWER_ENABLE0_ASRCBANK0_PWR_IC_1      0x1    /* 1b	[8] */
#define R15_POWER_ENABLE0_ASRCBANK1_PWR_IC_1      0x1    /* 1b	[9] */
#define R15_POWER_ENABLE0_CLK_GEN1_PWR_IC_1       0x1    /* 1b	[10] */
#define R15_POWER_ENABLE0_CLK_GEN2_PWR_IC_1       0x1    /* 1b	[11] */
#define R15_POWER_ENABLE0_CLK_GEN3_PWR_IC_1       0x1    /* 1b	[12] */
#define R15_POWER_ENABLE0_SIN0_PWR_IC_1_MASK      0x1
#define R15_POWER_ENABLE0_SIN0_PWR_IC_1_SHIFT     0
#define R15_POWER_ENABLE0_SIN1_PWR_IC_1_MASK      0x2
#define R15_POWER_ENABLE0_SIN1_PWR_IC_1_SHIFT     1
#define R15_POWER_ENABLE0_SIN2_PWR_IC_1_MASK      0x4
#define R15_POWER_ENABLE0_SIN2_PWR_IC_1_SHIFT     2
#define R15_POWER_ENABLE0_SIN3_PWR_IC_1_MASK      0x8
#define R15_POWER_ENABLE0_SIN3_PWR_IC_1_SHIFT     3
#define R15_POWER_ENABLE0_SOUT0_PWR_IC_1_MASK     0x10
#define R15_POWER_ENABLE0_SOUT0_PWR_IC_1_SHIFT    4
#define R15_POWER_ENABLE0_SOUT1_PWR_IC_1_MASK     0x20
#define R15_POWER_ENABLE0_SOUT1_PWR_IC_1_SHIFT    5
#define R15_POWER_ENABLE0_SOUT2_PWR_IC_1_MASK     0x40
#define R15_POWER_ENABLE0_SOUT2_PWR_IC_1_SHIFT    6
#define R15_POWER_ENABLE0_SOUT3_PWR_IC_1_MASK     0x80
#define R15_POWER_ENABLE0_SOUT3_PWR_IC_1_SHIFT    7
#define R15_POWER_ENABLE0_ASRCBANK0_PWR_IC_1_MASK 0x100
#define R15_POWER_ENABLE0_ASRCBANK0_PWR_IC_1_SHIFT 8
#define R15_POWER_ENABLE0_ASRCBANK1_PWR_IC_1_MASK 0x200
#define R15_POWER_ENABLE0_ASRCBANK1_PWR_IC_1_SHIFT 9
#define R15_POWER_ENABLE0_CLK_GEN1_PWR_IC_1_MASK  0x400
#define R15_POWER_ENABLE0_CLK_GEN1_PWR_IC_1_SHIFT 10
#define R15_POWER_ENABLE0_CLK_GEN2_PWR_IC_1_MASK  0x800
#define R15_POWER_ENABLE0_CLK_GEN2_PWR_IC_1_SHIFT 11
#define R15_POWER_ENABLE0_CLK_GEN3_PWR_IC_1_MASK  0x1000
#define R15_POWER_ENABLE0_CLK_GEN3_PWR_IC_1_SHIFT 12

/* POWER_ENABLE1 (IC 1) */
#define R16_POWER_ENABLE1_ADC_PWR_IC_1            0x1    /* 1b	[0] */
#define R16_POWER_ENABLE1_RX_PWR_IC_1             0x1    /* 1b	[1] */
#define R16_POWER_ENABLE1_TX_PWR_IC_1             0x1    /* 1b	[2] */
#define R16_POWER_ENABLE1_PDM0_PWR_IC_1           0x1    /* 1b	[3] */
#define R16_POWER_ENABLE1_PDM1_PWR_IC_1           0x1    /* 1b	[4] */
#define R16_POWER_ENABLE1_ADC_PWR_IC_1_MASK       0x1
#define R16_POWER_ENABLE1_ADC_PWR_IC_1_SHIFT      0
#define R16_POWER_ENABLE1_RX_PWR_IC_1_MASK        0x2
#define R16_POWER_ENABLE1_RX_PWR_IC_1_SHIFT       1
#define R16_POWER_ENABLE1_TX_PWR_IC_1_MASK        0x4
#define R16_POWER_ENABLE1_TX_PWR_IC_1_SHIFT       2
#define R16_POWER_ENABLE1_PDM0_PWR_IC_1_MASK      0x8
#define R16_POWER_ENABLE1_PDM0_PWR_IC_1_SHIFT     3
#define R16_POWER_ENABLE1_PDM1_PWR_IC_1_MASK      0x10
#define R16_POWER_ENABLE1_PDM1_PWR_IC_1_SHIFT     4

