huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* FTDM_IN2 (IC 1) */
#define R76_FTDM_IN2_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R76_FTDM_IN2_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R76_FTDM_IN2_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R76_FTDM_IN2_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R76_FTDM_IN2_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R76_FTDM_IN2_BYTE_IN_POS_IC_1_MASK        0x3
#define R76_FTDM_IN2_BYTE_IN_POS_IC_1_SHIFT       0
#define R76_FTDM_IN2_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R76_FTDM_IN2_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R76_FTDM_IN2_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R76_FTDM_IN2_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R76_FTDM_IN2_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R76_FTDM_IN2_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R76_FTDM_IN2_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R76_FTDM_IN2_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN3 (IC 1) */
#define R77_FTDM_IN3_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R77_FTDM_IN3_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R77_FTDM_IN3_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R77_FTDM_IN3_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R77_FTDM_IN3_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R77_FTDM_IN3_BYTE_IN_POS_IC_1_MASK        0x3
#define R77_FTDM_IN3_BYTE_IN_POS_IC_1_SHIFT       0
#define R77_FTDM_IN3_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R77_FTDM_IN3_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R77_FTDM_IN3_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R77_FTDM_IN3_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R77_FTDM_IN3_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R77_FTDM_IN3_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R77_FTDM_IN3_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R77_FTDM_IN3_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN4 (IC 1) */
#define R78_FTDM_IN4_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R78_FTDM_IN4_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R78_FTDM_IN4_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R78_FTDM_IN4_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R78_FTDM_IN4_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R78_FTDM_IN4_BYTE_IN_POS_IC_1_MASK        0x3
#define R78_FTDM_IN4_BYTE_IN_POS_IC_1_SHIFT       0
#define R78_FTDM_IN4_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R78_FTDM_IN4_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R78_FTDM_IN4_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R78_FTDM_IN4_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R78_FTDM_IN4_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R78_FTDM_IN4_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R78_FTDM_IN4_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R78_FTDM_IN4_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN5 (IC 1) */
#define R79_FTDM_IN5_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R79_FTDM_IN5_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R79_FTDM_IN5_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R79_FTDM_IN5_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R79_FTDM_IN5_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R79_FTDM_IN5_BYTE_IN_POS_IC_1_MASK        0x3
#define R79_FTDM_IN5_BYTE_IN_POS_IC_1_SHIFT       0
#define R79_FTDM_IN5_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R79_FTDM_IN5_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R79_FTDM_IN5_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R79_FTDM_IN5_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R79_FTDM_IN5_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R79_FTDM_IN5_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R79_FTDM_IN5_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R79_FTDM_IN5_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN6 (IC 1) */
#define R80_FTDM_IN6_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R80_FTDM_IN6_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R80_FTDM_IN6_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R80_FTDM_IN6_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R80_FTDM_IN6_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R80_FTDM_IN6_BYTE_IN_POS_IC_1_MASK        0x3
#define R80_FTDM_IN6_BYTE_IN_POS_IC_1_SHIFT       0
#define R80_FTDM_IN6_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R80_FTDM_IN6_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R80_FTDM_IN6_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R80_FTDM_IN6_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R80_FTDM_IN6_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R80_FTDM_IN6_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R80_FTDM_IN6_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R80_FTDM_IN6_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN7 (IC 1) */
#define R81_FTDM_IN7_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R81_FTDM_IN7_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R81_FTDM_IN7_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R81_FTDM_IN7_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R81_FTDM_IN7_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R81_FTDM_IN7_BYTE_IN_POS_IC_1_MASK        0x3
#define R81_FTDM_IN7_BYTE_IN_POS_IC_1_SHIFT       0
#define R81_FTDM_IN7_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R81_FTDM_IN7_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R81_FTDM_IN7_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R81_FTDM_IN7_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R81_FTDM_IN7_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R81_FTDM_IN7_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R81_FTDM_IN7_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R81_FTDM_IN7_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN8 (IC 1) */
#define R82_FTDM_IN8_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R82_FTDM_IN8_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R82_FTDM_IN8_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R82_FTDM_IN8_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R82_FTDM_IN8_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R82_FTDM_IN8_BYTE_IN_POS_IC_1_MASK        0x3
#define R82_FTDM_IN8_BYTE_IN_POS_IC_1_SHIFT       0
#define R82_FTDM_IN8_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R82_FTDM_IN8_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R82_FTDM_IN8_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R82_FTDM_IN8_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R82_FTDM_IN8_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R82_FTDM_IN8_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R82_FTDM_IN8_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R82_FTDM_IN8_SLOT_ENABLE_IN_IC_1_SHIFT    7

