huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* PANIC_SOFTWARE_MASK (IC 1) */
#define R211_PANIC_SOFTWARE_MASK_PANIC_SOFTWARE_IC_1 0x0 /* 0b	[0] */
#define R211_PANIC_SOFTWARE_MASK_PANIC_SOFTWARE_IC_1_MASK 0x1
#define R211_PANIC_SOFTWARE_MASK_PANIC_SOFTWARE_IC_1_SHIFT 0

/* PANIC_WD_MASK (IC 1) */
#define R212_PANIC_WD_MASK_PANIC_WD_IC_1          0x0    /* 0b	[0] */
#define R212_PANIC_WD_MASK_PANIC_WD_IC_1_MASK     0x1
#define R212_PANIC_WD_MASK_PANIC_WD_IC_1_SHIFT    0

/* PANIC_STACK_MASK (IC 1) */
#define R213_PANIC_STACK_MASK_PANIC_STACK_IC_1    0x0    /* 0b	[0] */
#define R213_PANIC_STACK_MASK_PANIC_STACK_IC_1_MASK 0x1
#define R213_PANIC_STACK_MASK_PANIC_STACK_IC_1_SHIFT 0

/* PANIC_LOOP_MASK (IC 1) */
#define R214_PANIC_LOOP_MASK_PANIC_LOOP_IC_1      0x0    /* 0b	[0] */
#define R214_PANIC_LOOP_MASK_PANIC_LOOP_IC_1_MASK 0x1
#define R214_PANIC_LOOP_MASK_PANIC_LOOP_IC_1_SHIFT 0

/* PANIC_FLAG (IC 1) */
#define R215_PANIC_FLAG_PANIC_FLAG_IC_1           0x0    /* 0b	[0] */
#define R215_PANIC_FLAG_PANIC_FLAG_IC_1_MASK      0x1
#define R215_PANIC_FLAG_PANIC_FLAG_IC_1_SHIFT     0

/* PANIC_CODE (IC 1) */
#define R216_PANIC_CODE_ERR_ASRC0_IC_1            0x0    /* 0b	[0] */
#define R216_PANIC_CODE_ERR_ASRC1_IC_1            0x0    /* 0b	[1] */
#define R216_PANIC_CODE_ERR_PM0_IC_1              0x0    /* 0b	[2] */
#define R216_PANIC_CODE_ERR_PM1_IC_1              0x0    /* 0b	[3] */
#define R216_PANIC_CODE_ERR_DM0B0_IC_1            0x0    /* 0b	[4] */
#define R216_PANIC_CODE_ERR_DM0B1_IC_1            0x0    /* 0b	[5] */
#define R216_PANIC_CODE_ERR_DM0B2_IC_1            0x0    /* 0b	[6] */
#define R216_PANIC_CODE_ERR_DM0B3_IC_1            0x0    /* 0b	[7] */
#define R216_PANIC_CODE_ERR_DM1B0_IC_1            0x0    /* 0b	[8] */
#define R216_PANIC_CODE_ERR_DM1B1_IC_1            0x0    /* 0b	[9] */
#define R216_PANIC_CODE_ERR_DM1B2_IC_1            0x0    /* 0b	[10] */
#define R216_PANIC_CODE_ERR_DM1B3_IC_1            0x0    /* 0b	[11] */
#define R216_PANIC_CODE_ERR_WATCHDOG_IC_1         0x0    /* 0b	[12] */
#define R216_PANIC_CODE_ERR_STACK_IC_1            0x0    /* 0b	[13] */
#define R216_PANIC_CODE_ERR_LOOP_IC_1             0x0    /* 0b	[14] */
#define R216_PANIC_CODE_ERR_SOFT_IC_1             0x0    /* 0b	[15] */
#define R216_PANIC_CODE_ERR_ASRC0_IC_1_MASK       0x1
#define R216_PANIC_CODE_ERR_ASRC0_IC_1_SHIFT      0
#define R216_PANIC_CODE_ERR_ASRC1_IC_1_MASK       0x2
#define R216_PANIC_CODE_ERR_ASRC1_IC_1_SHIFT      1
#define R216_PANIC_CODE_ERR_PM0_IC_1_MASK         0x4
#define R216_PANIC_CODE_ERR_PM0_IC_1_SHIFT        2
#define R216_PANIC_CODE_ERR_PM1_IC_1_MASK         0x8
#define R216_PANIC_CODE_ERR_PM1_IC_1_SHIFT        3
#define R216_PANIC_CODE_ERR_DM0B0_IC_1_MASK       0x10
#define R216_PANIC_CODE_ERR_DM0B0_IC_1_SHIFT      4
#define R216_PANIC_CODE_ERR_DM0B1_IC_1_MASK       0x20
#define R216_PANIC_CODE_ERR_DM0B1_IC_1_SHIFT      5
#define R216_PANIC_CODE_ERR_DM0B2_IC_1_MASK       0x40
#define R216_PANIC_CODE_ERR_DM0B2_IC_1_SHIFT      6
#define R216_PANIC_CODE_ERR_DM0B3_IC_1_MASK       0x80
#define R216_PANIC_CODE_ERR_DM0B3_IC_1_SHIFT      7
#define R216_PANIC_CODE_ERR_DM1B0_IC_1_MASK       0x100
#define R216_PANIC_CODE_ERR_DM1B0_IC_1_SHIFT      8
#define R216_PANIC_CODE_ERR_DM1B1_IC_1_MASK       0x200
#define R216_PANIC_CODE_ERR_DM1B1_IC_1_SHIFT      9
#define R216_PANIC_CODE_ERR_DM1B2_IC_1_MASK       0x400
#define R216_PANIC_CODE_ERR_DM1B2_IC_1_SHIFT      10
#define R216_PANIC_CODE_ERR_DM1B3_IC_1_MASK       0x800
#define R216_PANIC_CODE_ERR_DM1B3_IC_1_SHIFT      11
#define R216_PANIC_CODE_ERR_WATCHDOG_IC_1_MASK    0x1000
#define R216_PANIC_CODE_ERR_WATCHDOG_IC_1_SHIFT   12
#define R216_PANIC_CODE_ERR_STACK_IC_1_MASK       0x2000
#define R216_PANIC_CODE_ERR_STACK_IC_1_SHIFT      13
#define R216_PANIC_CODE_ERR_LOOP_IC_1_MASK        0x4000
#define R216_PANIC_CODE_ERR_LOOP_IC_1_SHIFT       14
#define R216_PANIC_CODE_ERR_SOFT_IC_1_MASK        0x8000
#define R216_PANIC_CODE_ERR_SOFT_IC_1_SHIFT       15

/* DECODE_OP0 (IC 1) */
#define R217_DECODE_OP0_DECODE_OP0_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R217_DECODE_OP0_DECODE_OP0_IC_1_MASK      0xFFFF
#define R217_DECODE_OP0_DECODE_OP0_IC_1_SHIFT     0

/* DECODE_OP1 (IC 1) */
#define R218_DECODE_OP1_DECODE_OP1_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R218_DECODE_OP1_DECODE_OP1_IC_1_MASK      0xFFFF
#define R218_DECODE_OP1_DECODE_OP1_IC_1_SHIFT     0

/* DECODE_OP2 (IC 1) */
#define R219_DECODE_OP2_DECODE_OP2_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R219_DECODE_OP2_DECODE_OP2_IC_1_MASK      0xFFFF
#define R219_DECODE_OP2_DECODE_OP2_IC_1_SHIFT     0

/* DECODE_OP3 (IC 1) */
#define R220_DECODE_OP3_DECODE_OP3_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R220_DECODE_OP3_DECODE_OP3_IC_1_MASK      0xFFFF
#define R220_DECODE_OP3_DECODE_OP3_IC_1_SHIFT     0

/* EXECUTE_OP0 (IC 1) */
#define R221_EXECUTE_OP0_DECODE_EX0_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R221_EXECUTE_OP0_DECODE_EX0_IC_1_MASK     0xFFFF
#define R221_EXECUTE_OP0_DECODE_EX0_IC_1_SHIFT    0

/* EXECUTE_OP1 (IC 1) */
#define R222_EXECUTE_OP1_DECODE_EX1_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R222_EXECUTE_OP1_DECODE_EX1_IC_1_MASK     0xFFFF
#define R222_EXECUTE_OP1_DECODE_EX1_IC_1_SHIFT    0

/* EXECUTE_OP2 (IC 1) */
#define R223_EXECUTE_OP2_DECODE_EX2_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R223_EXECUTE_OP2_DECODE_EX2_IC_1_MASK     0xFFFF
#define R223_EXECUTE_OP2_DECODE_EX2_IC_1_SHIFT    0

/* EXECUTE_OP3 (IC 1) */
#define R224_EXECUTE_OP3_DECODE_EX3_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R224_EXECUTE_OP3_DECODE_EX3_IC_1_MASK     0xFFFF
#define R224_EXECUTE_OP3_DECODE_EX3_IC_1_SHIFT    0

/* DECODE_COUNT (IC 1) */
#define R225_DECODE_COUNT_DECODE_COUNT_IC_1       0x0000 /* 0000000000000000b	[15:0] */
#define R225_DECODE_COUNT_DECODE_COUNT_IC_1_MASK  0xFFFF
#define R225_DECODE_COUNT_DECODE_COUNT_IC_1_SHIFT 0

/* EXECUTE_COUNT (IC 1) */
#define R226_EXECUTE_COUNT_EXECUTE_COUNT_IC_1     0x0000 /* 0000000000000000b	[15:0] */
#define R226_EXECUTE_COUNT_EXECUTE_COUNT_IC_1_MASK 0xFFFF
#define R226_EXECUTE_COUNT_EXECUTE_COUNT_IC_1_SHIFT 0

/* SOFTWARE_VALUE_0 (IC 1) */
#define R227_SOFTWARE_VALUE_0_SOFTWARE_VALUE_0_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R227_SOFTWARE_VALUE_0_SOFTWARE_VALUE_0_IC_1_MASK 0xFFFF
#define R227_SOFTWARE_VALUE_0_SOFTWARE_VALUE_0_IC_1_SHIFT 0

/* SOFTWARE_VALUE_1 (IC 1) */
#define R228_SOFTWARE_VALUE_1_SOFTWARE_VALUE_1_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R228_SOFTWARE_VALUE_1_SOFTWARE_VALUE_1_IC_1_MASK 0xFFFF
#define R228_SOFTWARE_VALUE_1_SOFTWARE_VALUE_1_IC_1_SHIFT 0

/* WATCHDOG_MAXCOUNT (IC 1) */
#define R229_WATCHDOG_MAXCOUNT_WD_MAXCOUNT_IC_1   0x000  /* 0000000000000b	[12:0] */
#define R229_WATCHDOG_MAXCOUNT_WD_MAXCOUNT_IC_1_MASK 0x1FFF
#define R229_WATCHDOG_MAXCOUNT_WD_MAXCOUNT_IC_1_SHIFT 0

