huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* WATCHDOG_PRESCALE (IC 1) */
#define R230_WATCHDOG_PRESCALE_WD_PRESCALE_IC_1   0x0    /* 0000b	[3:0] */
#define R230_WATCHDOG_PRESCALE_WD_PRESCALE_IC_1_MASK 0xF
#define R230_WATCHDOG_PRESCALE_WD_PRESCALE_IC_1_SHIFT 0

/* BLOCKINT_EN (IC 1) */
#define R231_BLOCKINT_EN_BLOCKINT_EN_IC_1         0x0    /* 0b	[0] */
#define R231_BLOCKINT_EN_BLOCKINT_EN_IC_1_MASK    0x1
#define R231_BLOCKINT_EN_BLOCKINT_EN_IC_1_SHIFT   0

/* BLOCKINT_VALUE (IC 1) */
#define R232_BLOCKINT_VALUE_BLOCKINT_VALUE_IC_1   0x0000 /* 0000000000000000b	[15:0] */
#define R232_BLOCKINT_VALUE_BLOCKINT_VALUE_IC_1_MASK 0xFFFF
#define R232_BLOCKINT_VALUE_BLOCKINT_VALUE_IC_1_SHIFT 0

/* PROG_CNTR0 (IC 1) */
#define R233_PROG_CNTR0_PROG_CNTR_MSB_IC_1        0x00   /* 00000000b	[7:0] */
#define R233_PROG_CNTR0_PROG_CNTR_MSB_IC_1_MASK   0xFF
#define R233_PROG_CNTR0_PROG_CNTR_MSB_IC_1_SHIFT  0

/* PROG_CNTR1 (IC 1) */
#define R234_PROG_CNTR1_PROG_CNTR_LSB_IC_1        0x0000 /* 0000000000000000b	[15:0] */
#define R234_PROG_CNTR1_PROG_CNTR_LSB_IC_1_MASK   0xFFFF
#define R234_PROG_CNTR1_PROG_CNTR_LSB_IC_1_SHIFT  0

/* PROG_CNTR_CLEAR (IC 1) */
#define R235_PROG_CNTR_CLEAR_PROG_CNTR_CLEAR_IC_1 0x0    /* 0b	[0] */
#define R235_PROG_CNTR_CLEAR_PROG_CNTR_CLEAR_IC_1_MASK 0x1
#define R235_PROG_CNTR_CLEAR_PROG_CNTR_CLEAR_IC_1_SHIFT 0

/* PROG_CNTR_LENGTH0 (IC 1) */
#define R236_PROG_CNTR_LENGTH0_PROG_LENGTH_MSB_IC_1 0x00 /* 00000000b	[7:0] */
#define R236_PROG_CNTR_LENGTH0_PROG_LENGTH_MSB_IC_1_MASK 0xFF
#define R236_PROG_CNTR_LENGTH0_PROG_LENGTH_MSB_IC_1_SHIFT 0

/* PROG_CNTR_LENGTH1 (IC 1) */
#define R237_PROG_CNTR_LENGTH1_PROG_LENGTH_LSB_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R237_PROG_CNTR_LENGTH1_PROG_LENGTH_LSB_IC_1_MASK 0xFFFF
#define R237_PROG_CNTR_LENGTH1_PROG_LENGTH_LSB_IC_1_SHIFT 0

/* PROG_CNTR_MAXLENGTH0 (IC 1) */
#define R238_PROG_CNTR_MAXLENGTH0_PROG_MAXLENGTH_MSB_IC_1 0x00 /* 00000000b	[7:0] */
#define R238_PROG_CNTR_MAXLENGTH0_PROG_MAXLENGTH_MSB_IC_1_MASK 0xFF
#define R238_PROG_CNTR_MAXLENGTH0_PROG_MAXLENGTH_MSB_IC_1_SHIFT 0

/* PROG_CNTR_MAXLENGTH1 (IC 1) */
#define R239_PROG_CNTR_MAXLENGTH1_PROG_MAXLENGTH_LSB_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R239_PROG_CNTR_MAXLENGTH1_PROG_MAXLENGTH_LSB_IC_1_MASK 0xFFFF
#define R239_PROG_CNTR_MAXLENGTH1_PROG_MAXLENGTH_LSB_IC_1_SHIFT 0

/* MP0_MODE (IC 1) */
#define R240_MP0_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R240_MP0_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R240_MP0_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R240_MP0_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R240_MP0_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R240_MP0_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R240_MP0_MODE_MP_MODE_IC_1_MASK           0xE
#define R240_MP0_MODE_MP_MODE_IC_1_SHIFT          1
#define R240_MP0_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R240_MP0_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R240_MP0_MODE_SS_SELECT_IC_1_MASK         0x700
#define R240_MP0_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP1_MODE (IC 1) */
#define R241_MP1_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R241_MP1_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R241_MP1_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R241_MP1_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R241_MP1_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R241_MP1_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R241_MP1_MODE_MP_MODE_IC_1_MASK           0xE
#define R241_MP1_MODE_MP_MODE_IC_1_SHIFT          1
#define R241_MP1_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R241_MP1_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R241_MP1_MODE_SS_SELECT_IC_1_MASK         0x700
#define R241_MP1_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP2_MODE (IC 1) */
#define R242_MP2_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R242_MP2_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R242_MP2_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R242_MP2_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R242_MP2_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R242_MP2_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R242_MP2_MODE_MP_MODE_IC_1_MASK           0xE
#define R242_MP2_MODE_MP_MODE_IC_1_SHIFT          1
#define R242_MP2_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R242_MP2_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R242_MP2_MODE_SS_SELECT_IC_1_MASK         0x700
#define R242_MP2_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP3_MODE (IC 1) */
#define R243_MP3_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R243_MP3_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R243_MP3_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R243_MP3_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R243_MP3_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R243_MP3_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R243_MP3_MODE_MP_MODE_IC_1_MASK           0xE
#define R243_MP3_MODE_MP_MODE_IC_1_SHIFT          1
#define R243_MP3_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R243_MP3_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R243_MP3_MODE_SS_SELECT_IC_1_MASK         0x700
#define R243_MP3_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP4_MODE (IC 1) */
#define R244_MP4_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R244_MP4_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R244_MP4_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R244_MP4_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R244_MP4_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R244_MP4_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R244_MP4_MODE_MP_MODE_IC_1_MASK           0xE
#define R244_MP4_MODE_MP_MODE_IC_1_SHIFT          1
#define R244_MP4_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R244_MP4_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R244_MP4_MODE_SS_SELECT_IC_1_MASK         0x700
#define R244_MP4_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP5_MODE (IC 1) */
#define R245_MP5_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R245_MP5_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R245_MP5_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R245_MP5_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R245_MP5_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R245_MP5_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R245_MP5_MODE_MP_MODE_IC_1_MASK           0xE
#define R245_MP5_MODE_MP_MODE_IC_1_SHIFT          1
#define R245_MP5_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R245_MP5_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R245_MP5_MODE_SS_SELECT_IC_1_MASK         0x700
#define R245_MP5_MODE_SS_SELECT_IC_1_SHIFT        8

