huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* MP6_MODE (IC 1) */
#define R246_MP6_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R246_MP6_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R246_MP6_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R246_MP6_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R246_MP6_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R246_MP6_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R246_MP6_MODE_MP_MODE_IC_1_MASK           0xE
#define R246_MP6_MODE_MP_MODE_IC_1_SHIFT          1
#define R246_MP6_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R246_MP6_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R246_MP6_MODE_SS_SELECT_IC_1_MASK         0x700
#define R246_MP6_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP7_MODE (IC 1) */
#define R247_MP7_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R247_MP7_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R247_MP7_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R247_MP7_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R247_MP7_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R247_MP7_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R247_MP7_MODE_MP_MODE_IC_1_MASK           0xE
#define R247_MP7_MODE_MP_MODE_IC_1_SHIFT          1
#define R247_MP7_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R247_MP7_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R247_MP7_MODE_SS_SELECT_IC_1_MASK         0x700
#define R247_MP7_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP8_MODE (IC 1) */
#define R248_MP8_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R248_MP8_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R248_MP8_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R248_MP8_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R248_MP8_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R248_MP8_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R248_MP8_MODE_MP_MODE_IC_1_MASK           0xE
#define R248_MP8_MODE_MP_MODE_IC_1_SHIFT          1
#define R248_MP8_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R248_MP8_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R248_MP8_MODE_SS_SELECT_IC_1_MASK         0x700
#define R248_MP8_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP9_MODE (IC 1) */
#define R249_MP9_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R249_MP9_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R249_MP9_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R249_MP9_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R249_MP9_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R249_MP9_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R249_MP9_MODE_MP_MODE_IC_1_MASK           0xE
#define R249_MP9_MODE_MP_MODE_IC_1_SHIFT          1
#define R249_MP9_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R249_MP9_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R249_MP9_MODE_SS_SELECT_IC_1_MASK         0x700
#define R249_MP9_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP10_MODE (IC 1) */
#define R250_MP10_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R250_MP10_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R250_MP10_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R250_MP10_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R250_MP10_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R250_MP10_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R250_MP10_MODE_MP_MODE_IC_1_MASK          0xE
#define R250_MP10_MODE_MP_MODE_IC_1_SHIFT         1
#define R250_MP10_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R250_MP10_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R250_MP10_MODE_SS_SELECT_IC_1_MASK        0x700
#define R250_MP10_MODE_SS_SELECT_IC_1_SHIFT       8

/* MP11_MODE (IC 1) */
#define R251_MP11_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R251_MP11_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R251_MP11_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R251_MP11_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R251_MP11_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R251_MP11_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R251_MP11_MODE_MP_MODE_IC_1_MASK          0xE
#define R251_MP11_MODE_MP_MODE_IC_1_SHIFT         1
#define R251_MP11_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R251_MP11_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R251_MP11_MODE_SS_SELECT_IC_1_MASK        0x700
#define R251_MP11_MODE_SS_SELECT_IC_1_SHIFT       8

/* MP12_MODE (IC 1) */
#define R252_MP12_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R252_MP12_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R252_MP12_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R252_MP12_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R252_MP12_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R252_MP12_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R252_MP12_MODE_MP_MODE_IC_1_MASK          0xE
#define R252_MP12_MODE_MP_MODE_IC_1_SHIFT         1
#define R252_MP12_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R252_MP12_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R252_MP12_MODE_SS_SELECT_IC_1_MASK        0x700
#define R252_MP12_MODE_SS_SELECT_IC_1_SHIFT       8

/* MP13_MODE (IC 1) */
#define R253_MP13_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R253_MP13_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R253_MP13_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R253_MP13_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R253_MP13_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R253_MP13_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R253_MP13_MODE_MP_MODE_IC_1_MASK          0xE
#define R253_MP13_MODE_MP_MODE_IC_1_SHIFT         1
#define R253_MP13_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R253_MP13_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R253_MP13_MODE_SS_SELECT_IC_1_MASK        0x700
#define R253_MP13_MODE_SS_SELECT_IC_1_SHIFT       8

/* MP0_WRITE (IC 1) */
#define R254_MP0_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R254_MP0_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R254_MP0_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP1_WRITE (IC 1) */
#define R255_MP1_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R255_MP1_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R255_MP1_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP2_WRITE (IC 1) */
#define R256_MP2_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R256_MP2_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R256_MP2_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

