huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* MP3_WRITE (IC 1) */
#define R257_MP3_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R257_MP3_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R257_MP3_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP4_WRITE (IC 1) */
#define R258_MP4_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R258_MP4_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R258_MP4_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP5_WRITE (IC 1) */
#define R259_MP5_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R259_MP5_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R259_MP5_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP6_WRITE (IC 1) */
#define R260_MP6_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R260_MP6_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R260_MP6_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP7_WRITE (IC 1) */
#define R261_MP7_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R261_MP7_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R261_MP7_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP8_WRITE (IC 1) */
#define R262_MP8_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R262_MP8_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R262_MP8_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP9_WRITE (IC 1) */
#define R263_MP9_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R263_MP9_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R263_MP9_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP10_WRITE (IC 1) */
#define R264_MP10_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R264_MP10_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R264_MP10_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP11_WRITE (IC 1) */
#define R265_MP11_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R265_MP11_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R265_MP11_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP12_WRITE (IC 1) */
#define R266_MP12_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R266_MP12_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R266_MP12_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP13_WRITE (IC 1) */
#define R267_MP13_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R267_MP13_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R267_MP13_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP0_READ (IC 1) */
#define R268_MP0_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R268_MP0_READ_MP_REG_READ_IC_1_MASK       0x1
#define R268_MP0_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP1_READ (IC 1) */
#define R269_MP1_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R269_MP1_READ_MP_REG_READ_IC_1_MASK       0x1
#define R269_MP1_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP2_READ (IC 1) */
#define R270_MP2_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R270_MP2_READ_MP_REG_READ_IC_1_MASK       0x1
#define R270_MP2_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP3_READ (IC 1) */
#define R271_MP3_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R271_MP3_READ_MP_REG_READ_IC_1_MASK       0x1
#define R271_MP3_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP4_READ (IC 1) */
#define R272_MP4_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R272_MP4_READ_MP_REG_READ_IC_1_MASK       0x1
#define R272_MP4_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP5_READ (IC 1) */
#define R273_MP5_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R273_MP5_READ_MP_REG_READ_IC_1_MASK       0x1
#define R273_MP5_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP6_READ (IC 1) */
#define R274_MP6_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R274_MP6_READ_MP_REG_READ_IC_1_MASK       0x1
#define R274_MP6_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP7_READ (IC 1) */
#define R275_MP7_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R275_MP7_READ_MP_REG_READ_IC_1_MASK       0x1
#define R275_MP7_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP8_READ (IC 1) */
#define R276_MP8_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R276_MP8_READ_MP_REG_READ_IC_1_MASK       0x1
#define R276_MP8_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP9_READ (IC 1) */
#define R277_MP9_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R277_MP9_READ_MP_REG_READ_IC_1_MASK       0x1
#define R277_MP9_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP10_READ (IC 1) */
#define R278_MP10_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R278_MP10_READ_MP_REG_READ_IC_1_MASK      0x1
#define R278_MP10_READ_MP_REG_READ_IC_1_SHIFT     0

/* MP11_READ (IC 1) */
#define R279_MP11_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R279_MP11_READ_MP_REG_READ_IC_1_MASK      0x1
#define R279_MP11_READ_MP_REG_READ_IC_1_SHIFT     0

/* MP12_READ (IC 1) */
#define R280_MP12_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R280_MP12_READ_MP_REG_READ_IC_1_MASK      0x1
#define R280_MP12_READ_MP_REG_READ_IC_1_SHIFT     0

/* MP13_READ (IC 1) */
#define R281_MP13_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R281_MP13_READ_MP_REG_READ_IC_1_MASK      0x1
#define R281_MP13_READ_MP_REG_READ_IC_1_SHIFT     0

/* DMIC_CTRL0 (IC 1) */
#define R282_DMIC_CTRL0_DMIC_EN_IC_1              0x0    /* 0b	[0] */
#define R282_DMIC_CTRL0_DMSW_IC_1                 0x0    /* 0b	[1] */
#define R282_DMIC_CTRL0_DMPOL_IC_1                0x0    /* 0b	[2] */
#define R282_DMIC_CTRL0_HPF_IC_1                  0x0    /* 0b	[3] */
#define R282_DMIC_CTRL0_DMIC_CLK_IC_1             0x0    /* 000b	[6:4] */
#define R282_DMIC_CTRL0_MIC_DATA_SRC_IC_1         0x0    /* 0000b	[11:8] */
#define R282_DMIC_CTRL0_CUTOFF_IC_1               0x4    /* 100b	[14:12] */
#define R282_DMIC_CTRL0_DMIC_EN_IC_1_MASK         0x1
#define R282_DMIC_CTRL0_DMIC_EN_IC_1_SHIFT        0
#define R282_DMIC_CTRL0_DMSW_IC_1_MASK            0x2
#define R282_DMIC_CTRL0_DMSW_IC_1_SHIFT           1
#define R282_DMIC_CTRL0_DMPOL_IC_1_MASK           0x4
#define R282_DMIC_CTRL0_DMPOL_IC_1_SHIFT          2
#define R282_DMIC_CTRL0_HPF_IC_1_MASK             0x8
#define R282_DMIC_CTRL0_HPF_IC_1_SHIFT            3
#define R282_DMIC_CTRL0_DMIC_CLK_IC_1_MASK        0x70
#define R282_DMIC_CTRL0_DMIC_CLK_IC_1_SHIFT       4
#define R282_DMIC_CTRL0_MIC_DATA_SRC_IC_1_MASK    0xF00
#define R282_DMIC_CTRL0_MIC_DATA_SRC_IC_1_SHIFT   8
#define R282_DMIC_CTRL0_CUTOFF_IC_1_MASK          0x7000
#define R282_DMIC_CTRL0_CUTOFF_IC_1_SHIFT         12

/* DMIC_CTRL1 (IC 1) */
#define R283_DMIC_CTRL1_DMIC_EN_IC_1              0x0    /* 0b	[0] */
#define R283_DMIC_CTRL1_DMSW_IC_1                 0x0    /* 0b	[1] */
#define R283_DMIC_CTRL1_DMPOL_IC_1                0x0    /* 0b	[2] */
#define R283_DMIC_CTRL1_HPF_IC_1                  0x0    /* 0b	[3] */
#define R283_DMIC_CTRL1_DMIC_CLK_IC_1             0x0    /* 000b	[6:4] */
#define R283_DMIC_CTRL1_MIC_DATA_SRC_IC_1         0x0    /* 0000b	[11:8] */
#define R283_DMIC_CTRL1_CUTOFF_IC_1               0x4    /* 100b	[14:12] */
#define R283_DMIC_CTRL1_DMIC_EN_IC_1_MASK         0x1
#define R283_DMIC_CTRL1_DMIC_EN_IC_1_SHIFT        0
#define R283_DMIC_CTRL1_DMSW_IC_1_MASK            0x2
#define R283_DMIC_CTRL1_DMSW_IC_1_SHIFT           1
#define R283_DMIC_CTRL1_DMPOL_IC_1_MASK           0x4
#define R283_DMIC_CTRL1_DMPOL_IC_1_SHIFT          2
#define R283_DMIC_CTRL1_HPF_IC_1_MASK             0x8
#define R283_DMIC_CTRL1_HPF_IC_1_SHIFT            3
#define R283_DMIC_CTRL1_DMIC_CLK_IC_1_MASK        0x70
#define R283_DMIC_CTRL1_DMIC_CLK_IC_1_SHIFT       4
#define R283_DMIC_CTRL1_MIC_DATA_SRC_IC_1_MASK    0xF00
#define R283_DMIC_CTRL1_MIC_DATA_SRC_IC_1_SHIFT   8
#define R283_DMIC_CTRL1_CUTOFF_IC_1_MASK          0x7000
#define R283_DMIC_CTRL1_CUTOFF_IC_1_SHIFT         12

/* ASRC_LOCK (IC 1) */
#define R284_ASRC_LOCK_ASRC0L_IC_1                0x0    /* 0b	[0] */
#define R284_ASRC_LOCK_ASRC1L_IC_1                0x0    /* 0b	[1] */
#define R284_ASRC_LOCK_ASRC2L_IC_1                0x0    /* 0b	[2] */
#define R284_ASRC_LOCK_ASRC3L_IC_1                0x0    /* 0b	[3] */
#define R284_ASRC_LOCK_ASRC4L_IC_1                0x0    /* 0b	[4] */
#define R284_ASRC_LOCK_ASRC5L_IC_1                0x0    /* 0b	[5] */
#define R284_ASRC_LOCK_ASRC6L_IC_1                0x0    /* 0b	[6] */
#define R284_ASRC_LOCK_ASRC7L_IC_1                0x0    /* 0b	[7] */
#define R284_ASRC_LOCK_ASRC0L_IC_1_MASK           0x1
#define R284_ASRC_LOCK_ASRC0L_IC_1_SHIFT          0
#define R284_ASRC_LOCK_ASRC1L_IC_1_MASK           0x2
#define R284_ASRC_LOCK_ASRC1L_IC_1_SHIFT          1
#define R284_ASRC_LOCK_ASRC2L_IC_1_MASK           0x4
#define R284_ASRC_LOCK_ASRC2L_IC_1_SHIFT          2
#define R284_ASRC_LOCK_ASRC3L_IC_1_MASK           0x8
#define R284_ASRC_LOCK_ASRC3L_IC_1_SHIFT          3
#define R284_ASRC_LOCK_ASRC4L_IC_1_MASK           0x10
#define R284_ASRC_LOCK_ASRC4L_IC_1_SHIFT          4
#define R284_ASRC_LOCK_ASRC5L_IC_1_MASK           0x20
#define R284_ASRC_LOCK_ASRC5L_IC_1_SHIFT          5
#define R284_ASRC_LOCK_ASRC6L_IC_1_MASK           0x40
#define R284_ASRC_LOCK_ASRC6L_IC_1_SHIFT          6
#define R284_ASRC_LOCK_ASRC7L_IC_1_MASK           0x80
#define R284_ASRC_LOCK_ASRC7L_IC_1_SHIFT          7

/* ASRC_MUTE (IC 1) */
#define R285_ASRC_MUTE_ASRC0M_IC_1                0x0    /* 0b	[0] */
#define R285_ASRC_MUTE_ASRC1M_IC_1                0x0    /* 0b	[1] */
#define R285_ASRC_MUTE_ASRC2M_IC_1                0x0    /* 0b	[2] */
#define R285_ASRC_MUTE_ASRC3M_IC_1                0x0    /* 0b	[3] */
#define R285_ASRC_MUTE_ASRC4M_IC_1                0x0    /* 0b	[4] */
#define R285_ASRC_MUTE_ASRC5M_IC_1                0x0    /* 0b	[5] */
#define R285_ASRC_MUTE_ASRC6M_IC_1                0x0    /* 0b	[6] */
#define R285_ASRC_MUTE_ASRC7M_IC_1                0x0    /* 0b	[7] */
#define R285_ASRC_MUTE_ASRC_RAMP0_IC_1            0x0    /* 0b	[8] */
#define R285_ASRC_MUTE_ASRC_RAMP1_IC_1            0x0    /* 0b	[9] */
#define R285_ASRC_MUTE_LOCKMUTE_IC_1              0x0    /* 0b	[10] */
#define R285_ASRC_MUTE_ASRC0M_IC_1_MASK           0x1
#define R285_ASRC_MUTE_ASRC0M_IC_1_SHIFT          0
#define R285_ASRC_MUTE_ASRC1M_IC_1_MASK           0x2
#define R285_ASRC_MUTE_ASRC1M_IC_1_SHIFT          1
#define R285_ASRC_MUTE_ASRC2M_IC_1_MASK           0x4
#define R285_ASRC_MUTE_ASRC2M_IC_1_SHIFT          2
#define R285_ASRC_MUTE_ASRC3M_IC_1_MASK           0x8
#define R285_ASRC_MUTE_ASRC3M_IC_1_SHIFT          3
#define R285_ASRC_MUTE_ASRC4M_IC_1_MASK           0x10
#define R285_ASRC_MUTE_ASRC4M_IC_1_SHIFT          4
#define R285_ASRC_MUTE_ASRC5M_IC_1_MASK           0x20
#define R285_ASRC_MUTE_ASRC5M_IC_1_SHIFT          5
#define R285_ASRC_MUTE_ASRC6M_IC_1_MASK           0x40
#define R285_ASRC_MUTE_ASRC6M_IC_1_SHIFT          6
#define R285_ASRC_MUTE_ASRC7M_IC_1_MASK           0x80
#define R285_ASRC_MUTE_ASRC7M_IC_1_SHIFT          7
#define R285_ASRC_MUTE_ASRC_RAMP0_IC_1_MASK       0x100
#define R285_ASRC_MUTE_ASRC_RAMP0_IC_1_SHIFT      8
#define R285_ASRC_MUTE_ASRC_RAMP1_IC_1_MASK       0x200
#define R285_ASRC_MUTE_ASRC_RAMP1_IC_1_SHIFT      9
#define R285_ASRC_MUTE_LOCKMUTE_IC_1_MASK         0x400
#define R285_ASRC_MUTE_LOCKMUTE_IC_1_SHIFT        10

/* ASRC0_RATIO (IC 1) */
#define R286_ASRC0_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R286_ASRC0_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R286_ASRC0_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC1_RATIO (IC 1) */
#define R287_ASRC1_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R287_ASRC1_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R287_ASRC1_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC2_RATIO (IC 1) */
#define R288_ASRC2_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R288_ASRC2_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R288_ASRC2_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC3_RATIO (IC 1) */
#define R289_ASRC3_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R289_ASRC3_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R289_ASRC3_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC4_RATIO (IC 1) */
#define R290_ASRC4_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R290_ASRC4_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R290_ASRC4_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC5_RATIO (IC 1) */
#define R291_ASRC5_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R291_ASRC5_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R291_ASRC5_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC6_RATIO (IC 1) */
#define R292_ASRC6_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R292_ASRC6_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R292_ASRC6_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ASRC7_RATIO (IC 1) */
#define R293_ASRC7_RATIO_ASRC_RATIO_IC_1          0x0000 /* 0000000000000000b	[15:0] */
#define R293_ASRC7_RATIO_ASRC_RATIO_IC_1_MASK     0xFFFF
#define R293_ASRC7_RATIO_ASRC_RATIO_IC_1_SHIFT    0

/* ADC_READ0 (IC 1) */
#define R294_ADC_READ0_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R294_ADC_READ0_ADC_VALUE_IC_1_MASK        0xFFFF
#define R294_ADC_READ0_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ1 (IC 1) */
#define R295_ADC_READ1_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R295_ADC_READ1_ADC_VALUE_IC_1_MASK        0xFFFF
#define R295_ADC_READ1_ADC_VALUE_IC_1_SHIFT       0

