huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* SPDIF_TX_EN (IC 1) */
#define R404_SPDIF_TX_EN_TXEN_IC_1                0x1    /* 1b	[0] */
#define R404_SPDIF_TX_EN_TXEN_IC_1_MASK           0x1
#define R404_SPDIF_TX_EN_TXEN_IC_1_SHIFT          0

/* SPDIF_TX_CTRL (IC 1) */
#define R405_SPDIF_TX_CTRL_TX_LENGTHCTRL_IC_1     0x0    /* 00b	[1:0] */
#define R405_SPDIF_TX_CTRL_TX_LENGTHCTRL_IC_1_MASK 0x3
#define R405_SPDIF_TX_CTRL_TX_LENGTHCTRL_IC_1_SHIFT 0

/* SPDIF_TX_AUXBIT_SOURCE (IC 1) */
#define R406_SPDIF_TX_AUXBIT_SOURCE_TX_AUXBITS_SOURCE_IC_1 0x0 /* 0b	[0] */
#define R406_SPDIF_TX_AUXBIT_SOURCE_TX_AUXBITS_SOURCE_IC_1_MASK 0x1
#define R406_SPDIF_TX_AUXBIT_SOURCE_TX_AUXBITS_SOURCE_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_0 (IC 1) */
#define R407_SPDIF_TX_CS_LEFT_0_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R407_SPDIF_TX_CS_LEFT_0_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R407_SPDIF_TX_CS_LEFT_0_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_1 (IC 1) */
#define R408_SPDIF_TX_CS_LEFT_1_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R408_SPDIF_TX_CS_LEFT_1_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R408_SPDIF_TX_CS_LEFT_1_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_2 (IC 1) */
#define R409_SPDIF_TX_CS_LEFT_2_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R409_SPDIF_TX_CS_LEFT_2_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R409_SPDIF_TX_CS_LEFT_2_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_3 (IC 1) */
#define R410_SPDIF_TX_CS_LEFT_3_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R410_SPDIF_TX_CS_LEFT_3_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R410_SPDIF_TX_CS_LEFT_3_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_4 (IC 1) */
#define R411_SPDIF_TX_CS_LEFT_4_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R411_SPDIF_TX_CS_LEFT_4_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R411_SPDIF_TX_CS_LEFT_4_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_5 (IC 1) */
#define R412_SPDIF_TX_CS_LEFT_5_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R412_SPDIF_TX_CS_LEFT_5_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R412_SPDIF_TX_CS_LEFT_5_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_6 (IC 1) */
#define R413_SPDIF_TX_CS_LEFT_6_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R413_SPDIF_TX_CS_LEFT_6_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R413_SPDIF_TX_CS_LEFT_6_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_7 (IC 1) */
#define R414_SPDIF_TX_CS_LEFT_7_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R414_SPDIF_TX_CS_LEFT_7_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R414_SPDIF_TX_CS_LEFT_7_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_8 (IC 1) */
#define R415_SPDIF_TX_CS_LEFT_8_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R415_SPDIF_TX_CS_LEFT_8_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R415_SPDIF_TX_CS_LEFT_8_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_9 (IC 1) */
#define R416_SPDIF_TX_CS_LEFT_9_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R416_SPDIF_TX_CS_LEFT_9_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R416_SPDIF_TX_CS_LEFT_9_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_10 (IC 1) */
#define R417_SPDIF_TX_CS_LEFT_10_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R417_SPDIF_TX_CS_LEFT_10_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R417_SPDIF_TX_CS_LEFT_10_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_11 (IC 1) */
#define R418_SPDIF_TX_CS_LEFT_11_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R418_SPDIF_TX_CS_LEFT_11_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R418_SPDIF_TX_CS_LEFT_11_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_0 (IC 1) */
#define R419_SPDIF_TX_CS_RIGHT_0_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R419_SPDIF_TX_CS_RIGHT_0_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R419_SPDIF_TX_CS_RIGHT_0_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_1 (IC 1) */
#define R420_SPDIF_TX_CS_RIGHT_1_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R420_SPDIF_TX_CS_RIGHT_1_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R420_SPDIF_TX_CS_RIGHT_1_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_2 (IC 1) */
#define R421_SPDIF_TX_CS_RIGHT_2_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R421_SPDIF_TX_CS_RIGHT_2_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R421_SPDIF_TX_CS_RIGHT_2_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_3 (IC 1) */
#define R422_SPDIF_TX_CS_RIGHT_3_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R422_SPDIF_TX_CS_RIGHT_3_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R422_SPDIF_TX_CS_RIGHT_3_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_4 (IC 1) */
#define R423_SPDIF_TX_CS_RIGHT_4_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R423_SPDIF_TX_CS_RIGHT_4_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R423_SPDIF_TX_CS_RIGHT_4_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_5 (IC 1) */
#define R424_SPDIF_TX_CS_RIGHT_5_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R424_SPDIF_TX_CS_RIGHT_5_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R424_SPDIF_TX_CS_RIGHT_5_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_6 (IC 1) */
#define R425_SPDIF_TX_CS_RIGHT_6_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R425_SPDIF_TX_CS_RIGHT_6_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R425_SPDIF_TX_CS_RIGHT_6_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_7 (IC 1) */
#define R426_SPDIF_TX_CS_RIGHT_7_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R426_SPDIF_TX_CS_RIGHT_7_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R426_SPDIF_TX_CS_RIGHT_7_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_8 (IC 1) */
#define R427_SPDIF_TX_CS_RIGHT_8_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R427_SPDIF_TX_CS_RIGHT_8_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R427_SPDIF_TX_CS_RIGHT_8_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_9 (IC 1) */
#define R428_SPDIF_TX_CS_RIGHT_9_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R428_SPDIF_TX_CS_RIGHT_9_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R428_SPDIF_TX_CS_RIGHT_9_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_10 (IC 1) */
#define R429_SPDIF_TX_CS_RIGHT_10_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R429_SPDIF_TX_CS_RIGHT_10_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R429_SPDIF_TX_CS_RIGHT_10_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_11 (IC 1) */
#define R430_SPDIF_TX_CS_RIGHT_11_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R430_SPDIF_TX_CS_RIGHT_11_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R430_SPDIF_TX_CS_RIGHT_11_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_0 (IC 1) */
#define R431_SPDIF_TX_UD_LEFT_0_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R431_SPDIF_TX_UD_LEFT_0_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R431_SPDIF_TX_UD_LEFT_0_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_1 (IC 1) */
#define R432_SPDIF_TX_UD_LEFT_1_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R432_SPDIF_TX_UD_LEFT_1_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R432_SPDIF_TX_UD_LEFT_1_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_2 (IC 1) */
#define R433_SPDIF_TX_UD_LEFT_2_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R433_SPDIF_TX_UD_LEFT_2_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R433_SPDIF_TX_UD_LEFT_2_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_3 (IC 1) */
#define R434_SPDIF_TX_UD_LEFT_3_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R434_SPDIF_TX_UD_LEFT_3_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R434_SPDIF_TX_UD_LEFT_3_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_4 (IC 1) */
#define R435_SPDIF_TX_UD_LEFT_4_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R435_SPDIF_TX_UD_LEFT_4_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R435_SPDIF_TX_UD_LEFT_4_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_5 (IC 1) */
#define R436_SPDIF_TX_UD_LEFT_5_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R436_SPDIF_TX_UD_LEFT_5_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R436_SPDIF_TX_UD_LEFT_5_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

