huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* SPDIF_TX_UD_LEFT_6 (IC 1) */
#define R437_SPDIF_TX_UD_LEFT_6_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R437_SPDIF_TX_UD_LEFT_6_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R437_SPDIF_TX_UD_LEFT_6_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_7 (IC 1) */
#define R438_SPDIF_TX_UD_LEFT_7_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R438_SPDIF_TX_UD_LEFT_7_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R438_SPDIF_TX_UD_LEFT_7_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_8 (IC 1) */
#define R439_SPDIF_TX_UD_LEFT_8_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R439_SPDIF_TX_UD_LEFT_8_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R439_SPDIF_TX_UD_LEFT_8_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_9 (IC 1) */
#define R440_SPDIF_TX_UD_LEFT_9_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R440_SPDIF_TX_UD_LEFT_9_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R440_SPDIF_TX_UD_LEFT_9_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_10 (IC 1) */
#define R441_SPDIF_TX_UD_LEFT_10_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R441_SPDIF_TX_UD_LEFT_10_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R441_SPDIF_TX_UD_LEFT_10_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_11 (IC 1) */
#define R442_SPDIF_TX_UD_LEFT_11_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R442_SPDIF_TX_UD_LEFT_11_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R442_SPDIF_TX_UD_LEFT_11_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_0 (IC 1) */
#define R443_SPDIF_TX_UD_RIGHT_0_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R443_SPDIF_TX_UD_RIGHT_0_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R443_SPDIF_TX_UD_RIGHT_0_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_1 (IC 1) */
#define R444_SPDIF_TX_UD_RIGHT_1_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R444_SPDIF_TX_UD_RIGHT_1_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R444_SPDIF_TX_UD_RIGHT_1_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_2 (IC 1) */
#define R445_SPDIF_TX_UD_RIGHT_2_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R445_SPDIF_TX_UD_RIGHT_2_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R445_SPDIF_TX_UD_RIGHT_2_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_3 (IC 1) */
#define R446_SPDIF_TX_UD_RIGHT_3_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R446_SPDIF_TX_UD_RIGHT_3_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R446_SPDIF_TX_UD_RIGHT_3_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_4 (IC 1) */
#define R447_SPDIF_TX_UD_RIGHT_4_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R447_SPDIF_TX_UD_RIGHT_4_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R447_SPDIF_TX_UD_RIGHT_4_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_5 (IC 1) */
#define R448_SPDIF_TX_UD_RIGHT_5_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R448_SPDIF_TX_UD_RIGHT_5_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R448_SPDIF_TX_UD_RIGHT_5_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_6 (IC 1) */
#define R449_SPDIF_TX_UD_RIGHT_6_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R449_SPDIF_TX_UD_RIGHT_6_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R449_SPDIF_TX_UD_RIGHT_6_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_7 (IC 1) */
#define R450_SPDIF_TX_UD_RIGHT_7_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R450_SPDIF_TX_UD_RIGHT_7_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R450_SPDIF_TX_UD_RIGHT_7_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_8 (IC 1) */
#define R451_SPDIF_TX_UD_RIGHT_8_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R451_SPDIF_TX_UD_RIGHT_8_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R451_SPDIF_TX_UD_RIGHT_8_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_9 (IC 1) */
#define R452_SPDIF_TX_UD_RIGHT_9_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R452_SPDIF_TX_UD_RIGHT_9_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R452_SPDIF_TX_UD_RIGHT_9_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_10 (IC 1) */
#define R453_SPDIF_TX_UD_RIGHT_10_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R453_SPDIF_TX_UD_RIGHT_10_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R453_SPDIF_TX_UD_RIGHT_10_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_11 (IC 1) */
#define R454_SPDIF_TX_UD_RIGHT_11_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R454_SPDIF_TX_UD_RIGHT_11_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R454_SPDIF_TX_UD_RIGHT_11_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_0 (IC 1) */
#define R455_SPDIF_TX_VB_LEFT_0_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R455_SPDIF_TX_VB_LEFT_0_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R455_SPDIF_TX_VB_LEFT_0_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_1 (IC 1) */
#define R456_SPDIF_TX_VB_LEFT_1_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R456_SPDIF_TX_VB_LEFT_1_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R456_SPDIF_TX_VB_LEFT_1_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_2 (IC 1) */
#define R457_SPDIF_TX_VB_LEFT_2_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R457_SPDIF_TX_VB_LEFT_2_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R457_SPDIF_TX_VB_LEFT_2_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_3 (IC 1) */
#define R458_SPDIF_TX_VB_LEFT_3_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R458_SPDIF_TX_VB_LEFT_3_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R458_SPDIF_TX_VB_LEFT_3_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_4 (IC 1) */
#define R459_SPDIF_TX_VB_LEFT_4_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R459_SPDIF_TX_VB_LEFT_4_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R459_SPDIF_TX_VB_LEFT_4_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_5 (IC 1) */
#define R460_SPDIF_TX_VB_LEFT_5_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R460_SPDIF_TX_VB_LEFT_5_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R460_SPDIF_TX_VB_LEFT_5_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

