huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* SDATA_IN2_PIN (IC 1) */
#define R521_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R521_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R521_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R521_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R521_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R521_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R521_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R521_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R521_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_IN3_PIN (IC 1) */
#define R522_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R522_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R522_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R522_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R522_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R522_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R522_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R522_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R522_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_OUT0_PIN (IC 1) */
#define R523_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R523_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R523_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R523_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R523_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R523_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R523_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R523_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R523_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT1_PIN (IC 1) */
#define R524_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R524_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R524_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R524_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R524_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R524_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R524_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R524_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R524_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT2_PIN (IC 1) */
#define R525_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R525_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R525_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R525_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R525_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R525_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R525_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R525_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R525_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT3_PIN (IC 1) */
#define R526_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R526_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R526_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R526_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R526_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R526_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R526_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R526_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R526_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SPDIF_TX_PIN (IC 1) */
#define R527_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R527_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R527_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1      0x0    /* 0b	[4] */
#define R527_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1_MASK 0x3
#define R527_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1_SHIFT 0
#define R527_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1_MASK 0xC
#define R527_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1_SHIFT 2
#define R527_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1_MASK 0x10
#define R527_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1_SHIFT 4

/* SCLK_SCL_PIN (IC 1) */
#define R528_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R528_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R528_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1      0x0    /* 0b	[4] */
#define R528_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1_MASK 0x3
#define R528_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1_SHIFT 0
#define R528_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1_MASK 0xC
#define R528_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1_SHIFT 2
#define R528_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1_MASK 0x10
#define R528_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1_SHIFT 4

/* MISO_SDA_PIN (IC 1) */
#define R529_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R529_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R529_MISO_SDA_PIN_MISO_SDA_PULL_IC_1      0x0    /* 0b	[4] */
#define R529_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1_MASK 0x3
#define R529_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1_SHIFT 0
#define R529_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1_MASK 0xC
#define R529_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1_SHIFT 2
#define R529_MISO_SDA_PIN_MISO_SDA_PULL_IC_1_MASK 0x10
#define R529_MISO_SDA_PIN_MISO_SDA_PULL_IC_1_SHIFT 4

/* SS_PIN (IC 1) */
#define R530_SS_PIN_SS_DRIVE_IC_1                 0x0    /* 00b	[1:0] */
#define R530_SS_PIN_SS_SLEW_IC_1                  0x2    /* 10b	[3:2] */
#define R530_SS_PIN_SS_PULL_IC_1                  0x1    /* 1b	[4] */
#define R530_SS_PIN_SS_DRIVE_IC_1_MASK            0x3
#define R530_SS_PIN_SS_DRIVE_IC_1_SHIFT           0
#define R530_SS_PIN_SS_SLEW_IC_1_MASK             0xC
#define R530_SS_PIN_SS_SLEW_IC_1_SHIFT            2
#define R530_SS_PIN_SS_PULL_IC_1_MASK             0x10
#define R530_SS_PIN_SS_PULL_IC_1_SHIFT            4

/* MOSI_ADDR1_PIN (IC 1) */
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1  0x1    /* 1b	[4] */
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1_MASK 0x3
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1_SHIFT 0
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1_MASK 0xC
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1_SHIFT 2
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1_MASK 0x10
#define R531_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1_SHIFT 4

/* SCLK_SCL_M_PIN (IC 1) */
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1  0x0    /* 0b	[4] */
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1_MASK 0x3
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1_SHIFT 0
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1_MASK 0xC
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1_SHIFT 2
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1_MASK 0x10
#define R532_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1_SHIFT 4

/* MISO_SDA_M_PIN (IC 1) */
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1  0x0    /* 0b	[4] */
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1_MASK 0x3
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1_SHIFT 0
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1_MASK 0xC
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1_SHIFT 2
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1_MASK 0x10
#define R533_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1_SHIFT 4

/* SS_M_PIN (IC 1) */
#define R534_SS_M_PIN_SS_M_DRIVE_IC_1             0x0    /* 00b	[1:0] */
#define R534_SS_M_PIN_SS_M_SLEW_IC_1              0x2    /* 10b	[3:2] */
#define R534_SS_M_PIN_SS_M_PULL_IC_1              0x1    /* 1b	[4] */
#define R534_SS_M_PIN_SS_M_DRIVE_IC_1_MASK        0x3
#define R534_SS_M_PIN_SS_M_DRIVE_IC_1_SHIFT       0
#define R534_SS_M_PIN_SS_M_SLEW_IC_1_MASK         0xC
#define R534_SS_M_PIN_SS_M_SLEW_IC_1_SHIFT        2
#define R534_SS_M_PIN_SS_M_PULL_IC_1_MASK         0x10
#define R534_SS_M_PIN_SS_M_PULL_IC_1_SHIFT        4

