huashan2019/stm32f103vct6/Source/SigmaStudio_Dsp/Dsp_IC_1_REG.h
/* MOSI_M_PIN (IC 1) */
#define R535_MOSI_M_PIN_MOSI_M_DRIVE_IC_1         0x0    /* 00b	[1:0] */
#define R535_MOSI_M_PIN_MOSI_M_SLEW_IC_1          0x2    /* 10b	[3:2] */
#define R535_MOSI_M_PIN_MOSI_M_PULL_IC_1          0x1    /* 1b	[4] */
#define R535_MOSI_M_PIN_MOSI_M_DRIVE_IC_1_MASK    0x3
#define R535_MOSI_M_PIN_MOSI_M_DRIVE_IC_1_SHIFT   0
#define R535_MOSI_M_PIN_MOSI_M_SLEW_IC_1_MASK     0xC
#define R535_MOSI_M_PIN_MOSI_M_SLEW_IC_1_SHIFT    2
#define R535_MOSI_M_PIN_MOSI_M_PULL_IC_1_MASK     0x10
#define R535_MOSI_M_PIN_MOSI_M_PULL_IC_1_SHIFT    4

/* MP6_PIN (IC 1) */
#define R536_MP6_PIN_MP6_DRIVE_IC_1               0x0    /* 00b	[1:0] */
#define R536_MP6_PIN_MP6_SLEW_IC_1                0x2    /* 10b	[3:2] */
#define R536_MP6_PIN_MP6_PULL_IC_1                0x1    /* 1b	[4] */
#define R536_MP6_PIN_MP6_DRIVE_IC_1_MASK          0x3
#define R536_MP6_PIN_MP6_DRIVE_IC_1_SHIFT         0
#define R536_MP6_PIN_MP6_SLEW_IC_1_MASK           0xC
#define R536_MP6_PIN_MP6_SLEW_IC_1_SHIFT          2
#define R536_MP6_PIN_MP6_PULL_IC_1_MASK           0x10
#define R536_MP6_PIN_MP6_PULL_IC_1_SHIFT          4

/* MP7_PIN (IC 1) */
#define R537_MP7_PIN_MP7_DRIVE_IC_1               0x0    /* 00b	[1:0] */
#define R537_MP7_PIN_MP7_SLEW_IC_1                0x2    /* 10b	[3:2] */
#define R537_MP7_PIN_MP7_PULL_IC_1                0x1    /* 1b	[4] */
#define R537_MP7_PIN_MP7_DRIVE_IC_1_MASK          0x3
#define R537_MP7_PIN_MP7_DRIVE_IC_1_SHIFT         0
#define R537_MP7_PIN_MP7_SLEW_IC_1_MASK           0xC
#define R537_MP7_PIN_MP7_SLEW_IC_1_SHIFT          2
#define R537_MP7_PIN_MP7_PULL_IC_1_MASK           0x10
#define R537_MP7_PIN_MP7_PULL_IC_1_SHIFT          4

/* CLKOUT_PIN (IC 1) */
#define R538_CLKOUT_PIN_CLKOUT_DRIVE_IC_1         0x0    /* 00b	[1:0] */
#define R538_CLKOUT_PIN_CLKOUT_SLEW_IC_1          0x2    /* 10b	[3:2] */
#define R538_CLKOUT_PIN_CLKOUT_PULL_IC_1          0x0    /* 0b	[4] */
#define R538_CLKOUT_PIN_CLKOUT_DRIVE_IC_1_MASK    0x3
#define R538_CLKOUT_PIN_CLKOUT_DRIVE_IC_1_SHIFT   0
#define R538_CLKOUT_PIN_CLKOUT_SLEW_IC_1_MASK     0xC
#define R538_CLKOUT_PIN_CLKOUT_SLEW_IC_1_SHIFT    2
#define R538_CLKOUT_PIN_CLKOUT_PULL_IC_1_MASK     0x10
#define R538_CLKOUT_PIN_CLKOUT_PULL_IC_1_SHIFT    4

/* SOFT_RESET (IC 1) */
#define R539_SOFTWARE_RESET_IC_1                  0x1    /* 1b	[0] */
#define R539_SOFTWARE_RESET_IC_1_MASK             0x1
#define R539_SOFTWARE_RESET_IC_1_SHIFT            0

#endif
